{
  "courseId": "5d004a66-1e36-4679-a54f-6fd426913ba3",
  "title": "Solidity fundamentals",
  "slug": "solidity",
  "folderName": "solidity",
  "lastUpdated": "Thu Dec 14 2023 10:13:39 GMT-0500 (Eastern Standard Time)",
  "trailerUrl": "",
  "previewImg": "https://res.cloudinary.com/droqoz7lg/image/upload/v1701193477/updraft/courses/qkrcodmbwwphpplbon0r.png",
  "description": "If you’re new to writing smart contracts, start here! Get started developing smart contracts with Solidity, learn the best practices followed by the top-industry experts and kickstart your web3 career.",
  "path": "content/learning-paths/solidity-developer.json",
  "number": 0,
  "githubUrl": "https://github.com/Cyfrin/path-solidity-developer-2023/discussions",
  "overview": {
    "learnings": "Introduction to smart contracts development and deployment, Introduction to blockchain oracles, Introduction to smart contracts testing ",
    "preRequisites": [
      "Blockchain basics"
    ]
  },
  "duration": 5,
  "authors": [
    {
      "author": "content/authors/patrick-collins.json"
    },
    {
      "author": "content/authors/austin-griffith.json"
    }
  ],
  "sections": [
    {
      "sectionId": "8f376c2c-270d-4022-94ea-9686079c6244",
      "number": 1,
      "title": "Simple Storage",
      "slug": "simple-storage",
      "folderName": "1-simple-storage",
      "lessons": [
        {
          "lessonId": "eb95ab4e-315d-4c2c-ada7-de40ad9ea462",
          "number": 1,
          "title": "Introduction",
          "slug": "introduction",
          "folderName": "1-introduction",
          "description": "This lesson provides an introduction to the course, guiding students through accessing and navigating the GitHub repository, understanding the usage of the repository for cloning lesson codes, and engaging in discussions. It also covers the importance of asking questions and setting up for coding, including accessing educational resources and preparing for building and deploying a smart contract.",
          "duration": 3,
          "videoUrl": "nzeR4vWsAz8",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/1-introduction/+page.md",
          "markdownContent": "---\ntitle: Repository Access and Navigation\n---\n\n*If you'd like, you can follow along with the course here.*\n\n\n\n\n## Introduction\n\nTo get started, navigate to our [GitHub repository](https://github.com/Cyfrin/foundry-full-course-f23) \n\n<img src=\"/solidity/remix/lesson-2/section-1/1.png\" style=\"width: 100%; height: auto;\">\n\n\nThe interface might look slightly different when you first access it, but no need to worry. What you're looking for is the repository associated specifically with this lesson. This repository will contain all the code required for this stage of the course, together with a `README` section. The `README` will provide you with a wealth of notes on how to work with the code.\n\n## Usage of the repository\n\nThe repository serves two main purposes:\n\n- **Access and Clone:** It provides easy access to all lesson codes, allowing you to clone them effortlessly.\n\n- **Discussion Section:** Engage with fellow students, ask questions, and participate in collaborative learning.\n\nMake the most of this repository by accessing and cloning lesson codes quickly, while also taking part in interactive discussions with your peers. Happy learning!\n\n## Asking Questions\n\nThroughout your journey, you'll likely have queries that you'd need answers to. We recommend using the Questions section provided. We'll guide you on how to ask questions such that they have the highest chance of receiving an answer from the community, an AI, or a forum.\n\n<img src=\"/solidity/remix/lesson-2/section-1/lesson-2-section-1-quoute.png\" style=\"width: 100%; height: auto;\">\n\n\n\n## Setting Up\n\nBefore we dive into coding, it is essential that you have access to the code repository and educational resources provided.\n\n1. Access the GitHub repository associated with this course. The repository contains all the code we will be working with, as well as a README file which includes important notes on working with the code.\n2. If you face any issues or want to participate in discussions, use the discussions tab on GitHub instead of creating issues.\n\nAlso, I recommend creating accounts on the following platforms if you haven't already:\n- [GitHub](https://github.com/)\n- [Stack Exchange Ethereum](https://ethereum.stackexchange.com/)\n- [Chat GPT](https://openai.com/blog/chatgpt) (but remember it might not always provide accurate information).\n\n## Let's Start Coding!\n\nNow, comes the exciting part — we're actually going to be building and deploying your first smart contract!\n\n\nWe're going to be utilizing a tool called an IDE — specifically, Remix, for deploying and interacting with this smart contract. The best way to get the most out of this guide is to code along with me. You're encouraged to change the speed on the tutorial video to match your coding pace. Remember, repetition is critical to building a new skill and we want to make sure that you come out on the other side armed with it!\n\n## The Deployment Tool: Remix\n\n<img src=\"/solidity/remix/remix-screenshot.png\" style=\"width: 100%; height: auto;\">\n\n\nTo plunge into coding, we're going to be using [Remix](https://remix.ethereum.org/). You can either Google search it or access it directly from the link provided.\n\nSo, let's jump right in and start deploying your first smart contract! By the end of this lesson, you'll have deployed your first smart contract and written your first bit of Solidity code. We can't wait to get through this exciting journey with you!\n\n\n\n\n",
          "updates": []
        },
        {
          "lessonId": "47b4427f-fb3e-4d7a-bb25-e26129720573",
          "number": 2,
          "title": "Setting up your first contract",
          "slug": "create-solidity-smart-contract",
          "folderName": "2-setting-up-your-first-contract",
          "description": "A beginner's guide to creating a Solidity smart contract using Remix IDE. The lesson covers the basics of setting up a Solidity development environment, including creating a new file, writing the contract, understanding SPDX License Identifier, and compiling the contract.",
          "duration": 11,
          "videoUrl": "1VYYhX7AXdI",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/2-setting-up-your-first-contract/+page.md",
          "markdownContent": "---\ntitle: Setting Up Your First Contract\n---\n\n*If you'd like, you can follow along with the course here.*\n\n\n\n\n# Introduction\n\nTo get started, we want to open up <a href=\"https://remix.ethereum.org/\" target=\"_blank\" style=\"color: blue; text-decoration: underline;\">remix</a>. When you open it up, you'll be greeted with a site that looks like this.\n\n<img src=\"/solidity/remix/remix-screenshot.png\" style=\"width: 100%; height: auto;\">\n\nYou may select \"Accept\" or just ignore. \n\n\n## Using Remix IDE\n\nRemix IDE is a powerful tool used for developing smart contracts in Solidity. In this section, we will be creating our smart contract and deploying it on a blockchain.\n\n1. Open Remix IDE by either searching on Google or visiting the link provided in the GitHub repository.\n2. If it's your first time using Remix, it will provide you a tutorial walkthrough of its features. You can choose to go through it.\n3. Clean the environment by right-clicking and deleting the existing folders (optional).\n4. Create a new file by clicking on the \"create new file\" button and give it a name, e.g., SimpleStorage.sol. The `.sol` extension indicates it is a Solidity file.\n\n<!--TODO: Add Support for Solidity on svelte-->\n\n```js\n// Your first line in SimpleStorage.sol\npragma solidity ^0.8.19;\n```\n\nThis line specifies the version of Solidity you are using. The caret (^) symbol specifies that the code is compatible with the mentioned version and any new version till (but not including) 0.9.0.\n\n## SPDX License Identifier\n\nIt's a good practice to start your smart contract with an SPDX License Identifier. Though it's not mandatory, it helps in making licensing and sharing code easier from a legal perspective.\n\n```js\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.18;\n```\n\nMIT is known as one of the most permissive licenses which means anybody can use this code and pretty much do whatever they want with it.\n\n## Writing the Smart Contract\n\nStart by writing your contract using the keyword `contract`. Give it a name, e.g., SimpleStorage. Everything inside the curly brackets will be considered part of this contract.\n\n```js\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.18;\n\ncontract SimpleStorage {\n\n}\n```\n\n## Compiling the Contract\n\n1. In Remix IDE, select the Solidity Compiler.\n2. Choose the version of the compiler that matches the version specified in your Solidity file.\n3. Hit the `Compile` button.\n\nCompiling your code means taking human-readable code and transforming it into computer-readable code or bytecode.\n\nIf you see a green checkmark, it means your compilation was successful. If there is any error, Remix will point out where the error is, and you can debug it accordingly.\n\n## Congratulations\n\nTechnically, you just drafted your first Smart Contract. It's a straightforward operation and the script doesn't do anything yet. However, we're well on our way.\n\n",
          "updates": []
        },
        {
          "lessonId": "390707ce-edd1-40df-9b81-8eb7c47ebb96",
          "number": 3,
          "title": "Basic variable types",
          "slug": "solidity-basic-types",
          "folderName": "3-basic-types",
          "description": "This lesson introduces basic variable types in Solidity, such as Boolean, Uint, Integer, Address, and Bytes. It explains how to define variables in a Solidity contract and their default values, providing a foundational understanding of data types in smart contract programming.",
          "duration": 9,
          "videoUrl": "rGckm0GeQFc",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/3-basic-types/+page.md",
          "markdownContent": "---\ntitle: Basic Solidity Types\n---\n\n*If you'd like, you can follow along with the course here.*\n\n\n\n## Learning about Solidity Types\n\nSolidity supports many different types, from primitive types like integers to complex ones like user-defined types. You can read more about them in the [Solidity documentation](https://docs.soliditylang.org/en/v0.8.20/types.html#types).\n\nFor now, let's focus on some of the basic types:\n\n- **Boolean:** Represents true or false value.\n- **Uint:** Uncapped positive whole number (An unsigned integer).\n- **Integer:** It could be positive or negative. (Whole numbers only, no fractions or decimals).\n- **Address:** A unique identifier similar to our everyday address.\n- **Bytes:** A set of bytes (a lower-level type that could be a string in hexadecimal representation).\n\n\n<img src=\"/solidity/remix/lesson-2/solidity-types/types.png\" style=\"width: 100%; height: auto;\">\n\n\n## Variables definitions in Solidity\n\nNow, let's understand variables. They are just placeholders for values, and these values can have one of the types from the list above (or even other types). For instance, we could create a Boolean variable named `hasFavoriteNumber`, which would represent whether someone has a favorite number or not (`True` or `False`).\n\n```bash\nbool hasFavoriteNumber = true;\n```\n\nIn the above statement, the variable `hasFavoriteNumber` now represents `True`.\n\nString and bytes have a special connection. In fact, strings are just bytes with special treatment for text. So, a string text can easily be converted to bytes.\n\n## The Magic that is 'Bytes'\n\nBytes could be observed in many shapes and forms, like an assortment of characters or words written in hexadecimal representation. Like integers, bytes too can be allocated size (but only up to `32`). For example:\n\n```bash\nbytes4 myBytes = \"test\";\n```\n\nIn the above statement, `myBytes` is a bytes variable, of size 4, holding the value \"test\".\n\n## Solidity Contract: Storing Favorite Numbers!\n\nLet's mark up a simple contract where we aim to store the favorite numbers of different people. We would only need the variable `favoriteNumber` of type Uint for this task.\n\n```bash\nuint256 favoriteNumber;\n```\n\nNow every variable in Solidity comes with a default value which may or may not be initialized. Like Uint256, it's default to Zero (0) and an uninitialized boolean defaults to `False`.\n\n```bash\nuint256 favoriteNumber = 0;\n```\n\nAbove statement suggests that favoriteNumber has been set to the default value of 0.\n\n## Wrapping Up\n\nYou've just created one smart contract and explored fundamental types and variables in Solidity in the process. Remember to write comments in your code. They’re like your map when re-visiting your code or explaining it to others.\n\nSo, keep experimenting, keep learning and let's continue with the next lesson.",
          "updates": []
        },
        {
          "lessonId": "f89fb538-7afa-486c-8a95-c402d755621c",
          "number": 4,
          "title": "Functions",
          "slug": "solidity-functions",
          "folderName": "4-functions",
          "description": "This lesson focuses on creating functions in Solidity, specifically a 'Store' function for updating a variable. It explains the syntax and structure of functions, including visibility specifiers, and guides students through deploying and interacting with the smart contract using the Remix IDE.",
          "duration": 20,
          "videoUrl": "RoeHK-wKDfk",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/4-functions/+page.md",
          "markdownContent": "---\ntitle: Functions & Deployment\n---\n\n\n*Follow along with the course here.*\n\n\n\n<!-- <img src=\"/solidity/remix/lesson-2/solidity-types/types.png\" style=\"width: 100%; height: auto;\"> -->\n\nLet's dive into creating our first Solidity function called `Store`. The function `Store` will be responsible for updating our `favoriteNumber` variable.\n\n## Building the Store Function\n\nIn Solidity programming, functions are identified by the keyword `Function`. You write the `Function` keyword, followed by the function's name, and additional parameters enclosed in parentheses. The parameters define the data a function needs to execute. For instance, to inform our `Store` function about the value it should use to update `favoriteNumber`, we pass a variable of type `uint256` named `_FavoriteNumber`.\n\nHere's how to define the function:\n\n\n\n```js\nfunction Store(uint256 _favoriteNumber) public {favoriteNumber = _favoriteNumber;}\n```\n\nWithin these brackets `{'{'}...{'}'}`, we indicate that the `favoriteNumber` variable is updated to `_favoriteNumber` whenever the `Store` function is called.\n\nThe prefix `_` indicates that `_favoriteNumber` is different from the favoriteNumber variable outside the function. This helps prevent potential confusion when dealing with different variables with similar names.\n\nThis function can be tested out on the local Remix VM.\n\n## Deploying the Smart Contract\n\nAt this stage, you can compile your code by navigating to the compile tab and hitting Compile. After compiling, navigate to the tab titled **Deploy and Run Transactions** to test your function.\n\nThe **Deploy and Run Transactions** tab holds a variety of parameters that are used during the deployment and running of transactions. The contract will be deployed to a simulated Remix VM environment.\n\n<img src=\"/solidity/remix/lesson-2/functions/deploy_and_run.png\" style=\"width: 100%; height: auto;\">\n\nIn the environment, your contract will have been assigned a unique address. As with MetaMask wallets, you can copy the contract's address using the copy tool and save it as a comment in your code.\n\n<img src=\"/solidity/remix/lesson-2/functions/deployment_address.png\" style=\"width: 100%; height: auto;\">\n\n\nAs shown below:\n\n```go\nThe Address of our Contract is: 0xd9145CCE52D386f254917e481eB44e9943F39138 This is a Sample Address\n\n```\n\nAgain, you can re-access your deployed contract by expanding the **Deployed Contracts** interface and simultaneously opening the terminal, which shows log data of all contract deployment and transactions.\n\n### Making Transactions with the Store Function\n\nNow, you can send a transaction to your `Store` function to change the variable `favoriteNumber`. By inputting a number and pressing the `Store` button, a transaction is initiated. After some time, the transaction's status will change from pending to complete.\n\nEvery transaction consumes Ether from your account as it is processed; Ether is spent for each operation inside Ethereum's virtual machine or EVM. In our case, deploying a contract and invoking its functions consumes gas (Ether).\n\nKeep in mind: whenever a value on the blockchain is modified, it's done by sending a transaction that consumes gas.\n\n### Checking the Transaction\n\nAt this point, you may want to confirm that the favorite number has actually been updated. The visibility of the `favoriteNumber` variable, however, is defaulted to internal thereby not allowing outside contracts and people to view it. But fear not, simply append the keyword `public` to variable `favoriteNumber` and you will be able to see it.\n\n```bash\nuint256 public favoriteNumber;\n```\n\nAfter compilation and deployment, a button labeled `favoriteNumber` will become visible. When pressed, it should return the value of `favoriteNumber`.\n\n<img src=\"/solidity/remix/lesson-2/functions/favorite-number.png\" style=\"width: 100%; height: auto;\">\n\n\n## Understanding Function &amp; Variable Visibility\n\nIn Solidity, functions and variables can have one of four visibility specifiers: \n- `public`\n- `private`\n- `external` \n- `internal`. \n  \nIf a visibility specifier is not given, it defaults to `internal`.\n\n<img src=\"/solidity/remix/lesson-2/functions/f1.png\" style=\"width: 100%; height: auto;\">\n<img src=\"/solidity/remix/lesson-2/functions/f2.png\" style=\"width: 100%; height: auto;\">\n\n## Deeper Understanding of Functions\n\nIn the case of retrieving a value from the blockchain without modification, Solidity provides `view` and `pure` keywords.\n\nA function marked as `view` is used when we simply need to read state from the blockchain (without modifying it). It is correspondent to the blue buttons in the Remix interface.\n\n```bash\nfunction retrieve() public view returns(uint256){return favoriteNumber;}\n```\n\n<img src=\"/solidity/remix/lesson-2/functions/blue-button.png\" style=\"width: 100%; height: auto;\">\n\n\nA `pure` function, on the other hand, disallows any reading from the state or storage or any modification of the state.\n\n```bash\nfunction retrieve() public pure returns(uint256){return 7;}\n```\n\nIt's worth mentioning that while calling `view` or `pure` functions don’t require gas, they do require gas when called by another function that modifies the state or storage through a transaction.\n\n## Understanding the Scope of a Variable\n\nThe scope of a variable is determined by the curly braces `{'{'}...{'}'}` in which it is declared. A variable can only be accessed within its declared scope. Therefore, if you need to access a variable on different functions, you should declare it outside the functions but inside the contract.\n\n## Conclusion\n\nIn this walk-through, you have learnt how to build a function in Solidity, define its visibility, and understand how it operates on values within a smart contract. You have also explored different transactions and how they consume gas. By understanding functions and their operations, you can take the next step in creating and deploying sophisticated smart contracts on the Ethereum blockchain.\n\nLet's keep learning!",
          "updates": []
        },
        {
          "lessonId": "271a2535-9ece-4e0b-8678-8794bd84a0b0",
          "number": 5,
          "title": "Arrays and structs",
          "slug": "solidity-arrays-and-structs",
          "folderName": "5-arrays-and-structs",
          "description": "This lesson explores the use of arrays and structs in Solidity for creating a list of favorite numbers and tying them to individuals. It demonstrates how to create and manipulate arrays and structs, enhancing the functionality of a smart contract to handle multiple data entries.",
          "duration": 13,
          "videoUrl": "uV40pjDC3fw",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/5-arrays-and-structs/+page.md",
          "markdownContent": "---\ntitle: Solidity Arrays & Structs\n---\n\n*Follow along with the course here.*\n\n\n\n## Storing and Tracking Favorite Numbers in Our Contract\n\nOur smart contract, as is, does an excellent job. It primarily enables users to store their favorite numbers, update them, and view them later. Sounds brilliant, right? Yet, it has been specifically designed to store a single favorite number at a time. What if we wanted to maintain not just our favorite number, but others as well?\n\nIn this lesson, we will explore how we can extend this functionality. We'll learn how to create a list of favorite numbers using arrays. Additionally, we will delve into using `structs` for creating new types in Solidity. Let's get started!\n\n### An Array of Favorite Numbers\n\nThe idea is to say goodbye to one `uint256` favorite number and say hello to a list of `uint256` numbers, or in our case, a list of favorite numbers. Here's the magic syntax:\n\n```bash\nuint256[] list_of_favorite_numbers;\n```\n\nThe bracket syntax identifies that we have a list of `uint256`, a list or array of numbers. An array of numbers would look something like this:\n\n```bash\nArray_Example_list_of_favorite_numbers = [0, 78, 90];\n```\n\nArrays are very dominant in computer science and programming, and an array in Solidity bears resemblance to an array in any other programming language. If you're new to arrays or lists, remember arrays are zero indexed. The first element starts from index zero, the second from index one, and so on.\n\n### Creating a Struct for `Person`\n\nBut an array of numbers is not enough - we wouldn't know whose favorite number is which! We need a way to tie favorite numbers to people. So let's evolve our code by defining a new type `Person` using the `Struct` keyword.\n\n```bash\nstruct Person {uint256 favorite_number;string name;}\n```\n\nRealize the beauty of this new type? Now each `Person` has a favorite number and a name! Remember we need to be particular about scope - don't let your internal variable names clash.\n\n```bash\nRenaming to avoid clashuint256 my_favorite_number;\n```\n\nWe can now create a variable of type `Person` the same way we did for `uint256`. Meet our friend Pat!\n\n```bash\nPerson public my_friend = Person(7, 'Pat');\n```\n\nSo, we've now created our own type `Person` and defined Pat who has a favorite number of seven and a name of 'Pat'. We can retrieve these details using the generated getter function thanks to the `public` visibility.\n\n### An Array of `Person`\n\nCreating individual variables for each friend might become a tedious task, especially when we'd like to add a large number of friends. What we can do instead is use the array syntax we've learned and create an array or list of `Person`.\n\n```bash\nPerson[] public list_of_people;\n```\n\nWhen using a dynamic array, we can add as many `Person` objects as we wish to our list, as the size of the array can now grow and shrink dynamically in Solidity. We can access each `Person` object in our array by its index.\n\n### Adding Persons to the List\n\nNext, we need to create a function that will allow us to add people to our list.\n\n```bash\nfunction add_person(string memory _name, uint256 _favorite_number) public {\n    list_of_people.push(Person(_favorite_number, _name));\n}\n```\n\n`add_person` is a function that takes two variables as input - the name and favorite number of the person. It creates a new `Person` object and adds it to our `list_of_people` array.\n\n### Final Thoughts\n\nWith these additions, our Solidity contract is now able to store multiple favorite numbers, each tied to a specific person. When called, our `add_person` function will create a new `Person`, add them to the dynamic array and we can view each person and corresponding favorite number via their array index.\n\nAnd that's it! We've now gone from a simple contract that stores just one favorite number to one that can handle multiple favorite numbers from different people. Happy coding!\n\n<img src=\"/solidity/remix/lesson-2/arrays-structs/note.png\" style=\"width: 100%; height: auto;\">\n",
          "updates": []
        },
        {
          "lessonId": "1b19ae88-aafa-4d49-be07-40f1a34bb6b7",
          "number": 6,
          "title": "Errors and warnings",
          "slug": "solidity-errors-and-warnings",
          "folderName": "6-errors-and-warnings",
          "description": "A guide to understanding and resolving errors and warnings in Solidity programming. The lesson covers interpreting the color coding of error messages, leveraging online resources like Phind, and effectively using communities like GitHub discussions and Stack Exchange for problem-solving.",
          "duration": 5,
          "videoUrl": "HjZQTFrs7qE",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/6-errors-and-warnings/+page.md",
          "markdownContent": "---\ntitle: Errors and Warnings\n---\n\n*Follow along with the course here.*\n\n\n\n<!-- <img src=\"/solidity/remix/lesson-2/arrays-structs/note.png\" style=\"width: 100%; height: auto;\"> -->\n\n## Interpreting the Color Coding\n\nWhen working with Solidity, if we negligently eliminate something crucial from our code – like semicolon – and then try to compile, we are met with a stream of red error messages. Whenever you see these red errors, it indicates that your code is not compiling. In essence, Solidity isn't able to convert your written code into machine-readable form.\n\nHere's an illustrative error message you might encounter:\n\n\n\n<img src=\"/solidity/remix/lesson-2/errors-warnings/errors2.png\" style=\"width: 100%; height: auto;\">\n\n\n\nHere, Solidity is complaining about a missing semicolon. So, to rectify this, we simply need to append a semicolon at the appropriate point in the code, then recompile. With the semicolon in place, no errors will occur, and we can go on to deploying our code to the blockchain.\n\nOn another note, let's consider what happens when we delete the SPDX license identifier from the top of our code, then recompile. Instead of a sea of red, we get a yellow box alerting us to a warning, rather than an error.\n\n```markdown\n> Warning: SPDX license identifier not provided in source file\n```\n<img src=\"/solidity/remix/lesson-2/errors-warnings/warning.png\" style=\"width: 100%; height: auto;\">\n\n\n\nIt's encouraging to note that, despite warnings, we can still compile and deploy our code. These warnings function as alerts; not as impediments. However, this should not be interpreted as carte blanche to ignore these alerts. They are warnings for a good reason. Often, they highlight poor or risky practices in your code, sometimes hinting at bugs. Thus, it's often wise to heed these warnings and modify your code accordingly.\n\nTo recap:\n\n- If it's <span style=\"color:red\">*red*</span>, it's broken.\n- If it's <span style=\"color:#808000\">*yellow*</span>, you might want to double-check.\n\n## Learning to Leverage Online Resources\n\nIn situations when the errors or warnings remain cryptic, we can turn to online resources for assistance. Suppose you encounter an error message that leaves you bewildered. In such cases, copying the error message and performing a Google search, or using resources highlighted in this course – such as Chat GPT, GitHub Discussions, Ethereum Stack Exchange – can make the situation clearer. Each of these resources has its strengths and weaknesses, which we will discuss later in the course.\n\n### Utilizing Phind – The AI Search Engine for Developers\n\nFor instance, using [Phind](https://www.phind.com/) can prove beneficial. **Phind** is an AI-powered search engine for developers. It operates by first conducting a Google search based on your query, then parsing the results to give you a contextual response.\n\n<img src=\"/solidity/remix/lesson-2/errors-warnings/questions.png\" style=\"width: 100%; height: auto;\">\n\n\nWe can enter the compiler error under the drop-down selection, then execute the search. The result is a detailed insight into why the error occurred and how to fix it.\n\n\n<img src=\"/solidity/remix/lesson-2/errors-warnings/phind-answer.png\" style=\"width: 100%; height: auto;\">\n\n\n\nAfter intensive AI analysis, **Phind** suggests that a simple addition of a semicolon where the new person is being pushed onto the dynamic 'people' array list, can resolve the issue.\n\n\n\n## Other Key Online Developer Resources\n\nSeveral AI tools are still in their developmental stages so they may not always render the perfect solution.\n\nOther remarkable communities include **GitHub discussions, Stack Exchange** among others.\n\n<img src=\"/solidity/remix/lesson-2/errors-warnings/quote1.png\" style=\"width: 100%; height: auto;\">\n\n\nWe encourage you to actively use these resources, as they can significantly enhance your understanding and skill.\n\nIn later parts of this course, we will take a closer look at posing effective questions, AI prompting, structuring your questions, as well as searching and learning more.\n\nShould you receive a less than satisfactory answer from Find or Chat GPT, feel free to use the GitHub discussions for course-specific queries. For broader questions about Solidity or Foundry, there are several other resources at your disposal.\n\nCongratulations! You've just taken your first steps into the domain of prompt engineering and the understanding to face errors and warnings head-on. In the next lesson, we will take a closer look at the Solidity and more advanced features of Remix.",
          "updates": []
        },
        {
          "lessonId": "1d8d1ef5-924a-4a2a-89cd-25c31f274e62",
          "number": 7,
          "title": "Memory storage and calldata",
          "slug": "solidity-memory-storage-calldata",
          "folderName": "7-memory-storage-calldata",
          "description": "An in-depth look at data locations in Solidity, focusing on the differences and applications of 'memory', 'storage', and 'calldata'. The lesson explains these concepts with examples, clarifying their roles in temporary and permanent data storage within smart contracts.",
          "duration": 6,
          "videoUrl": "ISBvYpFBTyo",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/7-memory-storage-calldata/+page.md",
          "markdownContent": "---\ntitle: Memory, Storage, and Calldata\n---\n\n\n*Follow along with the course here.*\n\n\n\n\nOne aspect that crashes the compilers and gets heads scratching is the `memory` keyword, which we can gloss over, as it's heavily entwined with the data locations in Solidity. You might be puzzled when you delete the keyword sometimes and you receive a compilation error. Let's dive into this conundrum.\n\n## Data Locations in Solidity\n\nSolidity allows data to be stored in 6 locations:\n\n1. Stack\n2. Memory\n3. Storage\n4. Calldata\n5. Code\n6. Logs\n\nFor the purposes of this post, we will focus on three principal ones: Call Data, Memory, and Storage. Adding a word of caution – this can get quite intricate. If you don’t comprehend everything on the first go, remember perseverance is the key.\n\n## Call Data and Memory: Temporary Variables\n\n<img src=\"/solidity/remix/lesson-2/memory/memory1.jpg\" style=\"width: 100%; height: auto;\">\n\n\nIn Solidity, `calldata` and `memory` relate to temporary variables that only exist during the execution of a function. If you run a function with a variable name for once, you can access it only for that particular function execution. If you try to retrieve the variable in the next function execution, you will fail because it was stored temporarily.\n\nExample:\n\n```bash\nstring memory name = \"Patrick\";\nuint256 favoriteNumber = 7;\n```\n\nStrings need special attention. In Solidity, you must specify either memory or call data due to the way arrays work in memory. Most variables automatically default to memory variables, while strings require explicit specification.\n\n<img src=\"/solidity/remix/lesson-2/memory/memory3.png\" style=\"width: 100%; height: auto;\">\n\n\nSo far, so right, but why do we have two variants of temporary variables? Let's explore more with an example.\n\n<img src=\"/solidity/remix/lesson-2/memory/calldata.png\" style=\"width: 100%; height: auto;\">\n\n\nNow, If we replace `memory` with `calldata` and try to compile it, we receive an error message. This occurred because, unlike `memory` variables, `calldata` variables can't be manipulated – they are read-only.\n\n## Storage: Permanent Variables\n\nWhile `calldata` and `memory` are designated for temporary variables, `storage` is for permanent variables that can be altered.\n\n<img src=\"/solidity/remix/lesson-2/memory/memory2.jpg\" style=\"width: 100%; height: auto;\">\n\n\nVariables declared outside any function, directly under the contract scope, are implicitly converted to storage variables.\n\n```bash\ncontract MyContract {\n    uint256 favoriteNumber = 123\n    };\n```\n\nYou can always retrieve these permanent variables later, even outside function calls.\n\n## The Essence of Memory Keyword\n\nNow, you might be thinking, why do we explicitly use the `memory` keyword on the String and not on the `uint256`, also you'll get an error stating `Data location can only be specified for array, struct, or mapping type`.\n\n<img src=\"/solidity/remix/lesson-2/memory/memory-err.png\" style=\"width: 100%; height: auto;\">\n\n\nSolidity recognizes `string` as an array of bytes (a special type) and due to memory management workings, we need to use `memory` with it. Primitive types such as the `uint256` are smart enough and know where to be located under the hood.\n\nRemember, you can't use the `storage` keyword for temporary variables inside a function. Only `memory` and `calldata` are allowed here because the variable only lives for a short duration.\n\n## Key Takeaway\n\n- When passed as function parameters, structs, mappings, and arrays in Solidity need to use the explicit `memory` keyword.\n- Strings, considered an array of bytes, require explicit `memory` or `calldata` keyword.\n\nCongratulations for reaching this point, now let's delve into Solidity mappings.",
          "updates": []
        },
        {
          "lessonId": "2022d3b1-4a00-429a-8fbd-e984114ba876",
          "number": 8,
          "title": "Mappings",
          "slug": "solidity-mappings",
          "folderName": "8-mappings",
          "description": "This lesson introduces the concept of mappings in Solidity, explaining how they can be used to efficiently link information, such as connecting names to numbers. It demonstrates how to define and use mappings to improve data access in a smart contract.",
          "duration": 5,
          "videoUrl": "o8lzK640cuA",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/8-mappings/+page.md",
          "markdownContent": "---\ntitle: Solidity Mappings\n---\n\n*Follow along with the course here.*\n\n\n\n\n\n## Understanding the Problem with Arrays\n\nImagine you have a contract that holds a list of individuals along with their favorite numbers:\n\n```json\n[\n    (\"Pat\", 7),\n    (\"John\", 8), \n    (\"Mariah\", 10), \n    (\"Chelsea\", 232)\n]\n```\n\nNow, if you want to know Chelsea's favorite number, you will have to run a loop through the array. This might seem fine when managing data of a few individuals, but imagine scaling this up to 1,000 or more. Constantly iterating through large arrays to locate a specific element can be incredibly time-consuming and inefficient.\n\nTake the scenario:\n\n```json\nOh, what was Chelsea's favorite number?\n    Array element at 0 - Pat.\n    Array element at 1 - John.\n    Array element at 2 - Mariah.\n    Array element at 3 - Chelsea => favorite number: 232.\n```\n\nIs there a better data structure that can improve this access process and make finding individual information a breeze?\n\nMeet `mapping`.\n\n## Mapping: A Simpler Way to Link Information\n\nThink of mapping in coding like a dictionary: each word in a dictionary has a unique meaning or a chunk of text associated with it. Similarly, a mapping in code is essentially a set of keys with each key returning a unique set of information. Thus, if you look up a word or a 'string' in coding terms, the corresponding output will be the text or 'number' associated only with that string.\n\nA typical way of defining a mapping starts with the keyword 'mapping', the key type, the datatype of data to be linked with each key and the visibility type. Let's create a mapping type:\n\n```javascript\nmapping (string => uint256) public nameToFavoriteNumber;\n```\n\nWith this, we have constructed a mapping that maps every string to a uint256 number emulating a link between a person's name and their favorite number. Now, rather than iterating through an array, we can directly enter the name and get their favorite number.\n\n## Augmenting the AddPerson Function\n\nPreviously, we had an `addPerson` function that enabled us to add someone to our list. Let's modify this function to update our mapping every time a person is added:\n\n```javascript\n// Adding someone to the mapping\nnameToFavoriteNumber[_name] = _favoriteNumber;\n```\n\nThis line will add a person's name to the mapping where each name will point to their favorite number. The result? A far quicker way to access a person's favorite number just by knowing their name.\n\n<img src=\"/solidity/remix/lesson-2/mappings/mappings1.png\" style=\"width: 100%; height: auto;\">\n\n\n## A Test Run\n\n<img src=\"/solidity/remix/lesson-2/mappings/mappings2.png\" style=\"width: 100%; height: auto;\">\n\n\nThe last example illustrates an important point. In a mapping, the default value for all key types is zero. Therefore, if you look up a key (person's name in this case) that hasn't been added yet, it will return the default value which is zero.\n\n## Wrapping Up\n\nIn conclusion, mapping in code can be a versatile tool to increase efficiency when attempting to find elements within larger lists or arrays. By streamlining the process with the use of a mapping, you can avoid the woes of constant iteration and instead achieve results more directly. As such, mapping is a useful tool every programmer should have in their toolbox.",
          "updates": []
        },
        {
          "lessonId": "bdcd4385-ca14-49c0-8367-cdf923c9e6ec",
          "number": 9,
          "title": "Deploying your first contract",
          "slug": "deploying-solidity-smart-contract",
          "folderName": "9-deploying",
          "description": "A practical guide to deploying a Solidity smart contract on a testnet. The lesson walks through the pre-deployment audit, compilation check, changing the environment, connecting accounts, confirming transactions, and interacting with the deployed contract.",
          "duration": 10,
          "videoUrl": "qHfWQpnvVLY",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/9-deploying/+page.md",
          "markdownContent": "---\ntitle: Deploying a Contract\n---\n\n*Follow along with the course here.*\n\n\n\n\n# Deploying A Simple Storage Contract On A Testnet\n\nIf you’ve been following along through our work with simple storage contract, you will see that we have progressively added functionality to our solidity contract. With our favorite number feature, typing person, public list, favorite number retrieval, and update functions, we’ve built up a solid contract structure. Now, it’s time to steer away from abstract theorizing and practically deploy this to a real **testnet**.\n\n\n## Pre-Deployment Audit\n\n<img src=\"/solidity/remix/lesson-2/deploying/deploying1.png\" style=\"width: 100%; height: auto;\">\n\n\n## Compilation Check\n\nThis ensures that our contract has no errors or warnings and is fit for deployment. Go to your development environment and ensure that you have a green checkmark, indicating a successful compilation.\n\n## Changing The Environment\n\nThe deployment process Kicks off by switching from the local virtual environment (Remix VM) to MetaMask as the Injected provider. Here's how you can make the switch:\n\n1. Navigate to the deploy tab\n2. Delete any content there\n3. Change the environment\n\nChoose the **Injected Provider MetaMask** option. This allows the web interface to interact with your MetaMask account.\n\n<img src=\"/solidity/remix/lesson-2/deploying/deploying2.png\" style=\"width: 100%; height: auto;\">\n\n\n## Connecting The Account\n\nUpon choosing MetaMask as your injected provider, you will be prompted to pick a specific account for use. Choose your desired account and proceed to connect it. Next, check your MetaMask display and ensure that your account is properly connected to Remix. It’s critical to double-check that you are on the correct testnet as this guide uses the Sapolia testnet.\n\n<img src=\"/solidity/remix/lesson-2/deploying/deploying3.png\" style=\"width: 100%; height: auto;\">\n\n\nIf have sufficient Sapolia ETH in your account provided from a [faucet](https://sepoliafaucet.com/), you can now go ahead and click the \"Deploy\" button.\n\n\n## Confirming The Transaction\n\nUpon hitting the deploy button, MetaMask will prompt you to confirm the transaction for contract deployment.\n\nSince we are on the Sapolia testnet and not on a mainnet, the money spent here is not real.\n\nClick \"Confirm\" to launch the contract deployment.\n\n<img src=\"/solidity/remix/lesson-2/deploying/deploying4.png\" style=\"width: 100%; height: auto;\">\n\n\n## Checking The Deployment\n\nAfter you confirm, you should now find the following indicators that your contract deployment is successful:\n\n- Green checkmark appears\n- Invocation status changes to ‘block confirmations’\n- Contract address appears under deployed contracts\n\n<img src=\"/solidity/remix/lesson-2/deploying/deploying5.png\" style=\"width: 100%; height: auto;\">\n\n\n\nIf you wait and refresh your etherscan page, you’ll see a \"Success\" status, along with the complete details of your transaction. For deployment transactions, the input data field will be larger than normal transaction data; it contains contract creation data, along with the gas fee details because any action that alters the blockchain requires gas for implementation.\n\n<img src=\"/solidity/remix/lesson-2/deploying/deploying6.png\" style=\"width: 100%; height: auto;\">\n\n\n# Interacting With The Deployed Contract\n\nNow that your contract has been successfully deployed, we can recreate the same Flexibility as we had on the virtual environment on this testnet.\n\nWe can call the Retrieve function, and Name to favorite function which returns zero and nothing respectively as we haven't updated anything. Adding zero in for the list of people also returns nothing as expected.\n\n# Updating The Blockchain\n\nTo update the blockchain, press store and input a number (e.g., 7878). MetaMask will prompt you to confirm the update transaction. This will update the favorite number on the contract.\n\nSimilar confirmation checks will be run, with transaction details available on etherscan.\n\n<img src=\"/solidity/remix/lesson-2/deploying/deploying7.png\" style=\"width: 100%; height: auto;\">\n\n## Celebrate Small Wins\n\nIf you’ve successfully followed all these steps, you’ve just navigated your first practical deployment of a smart contract to a testnet! Don't underestimate the importance of celebrating small developmental milestones. They are key psychological boosts that will keep you motivated and engage with any new skill you’re learning.\n\n\n## Deploying to Another Testnet\n\nIf you wanted to deploy to another testnet, just switch to the testnet, ensure sufficient ETH and repeat the deployment process.\n\n## Deploying to Mainnet\n\nFor the mainnet, the same process is applicable with the main difference being that you would require Ethereum, or in other words real money, to deploy.\n\nMoreover, if you want to deploy to other EVM compatible networks, we'll cover that in future guides.\n\n## Coining Yourself As A Solidity Developer\n\nBy deploying and interacting with your smart contract, you can confidently call yourself a solidity developer. Remember, every developer's journey comes with constant learning curves, so don’t stop here. Keep exploring and experimenting with Solidity and of course keep learning with the next lessons.",
          "updates": []
        },
        {
          "lessonId": "61efb7c8-e936-47de-8e49-dc8814b31ff6",
          "number": 10,
          "title": "Section recap",
          "slug": "evm-recap",
          "folderName": "10-evm-recap",
          "description": "A recap of the section, emphasizing the understanding and workings of the Ethereum Virtual Machine (EVM) and its compatibility with various blockchains. The lesson revisits the essentials of writing a smart contract, types and structures in Solidity, functions, data locations, and the importance of continued learning in Solidity development.",
          "duration": 3,
          "videoUrl": "5LUtOkruO_k",
          "rawMarkdownUrl": "/routes/solidity/1-simple-storage/10-evm-recap/+page.md",
          "markdownContent": "---\ntitle: Recap & Congratulations\n---\n\n*Follow along with the course here.*\n\n\n\n\n<!-- <img src=\"/solidity/remix/lesson-2/deploying/deploying1.png\" style=\"width: 100%; height: auto;\"> -->\n\n## Working with Ethereum Virtual Machine (EVM)\n\nOne term that frequently comes up when talking about deploying code onto a blockchain network is \"EVM,\" which stands for `Ethereum Virtual Machine`. Now, the EVM might seem like a complex term, but essentially it's a standard for how to compile and deploy smart contracts to a blockchain.\n\nFor anyone interacting with the blockchain space, particularly those deploying smart contracts, understanding the basic functioning and application of the Ethereum virtual machine is invaluable.\n\n\n\n## EVM Compatible Blockchains\n\nAny smart contract or solidity code you write can be deployed to any blockchain that is compatible with the EVM. Prime examples of such blockchains and Layer 2 solutions include **Ethereum**, **Polygon**, **Arbitram**, **Optimism**, and **Zksync**. Even though a blockchain, such as Zksync, might be EVM-compatible, it's critical to ensure that all keywords are compatible as some do not work with every EVM-compatible blockchain.\n\n<img src=\"/solidity/remix/lesson-2/evm/evm1.png\" style=\"width: 100%; height: auto;\">\n\n\nNow that we've understood the basics of EVM and its deployment, let's dive into the nitty-gritty of writing your solidity code for smart contracts.\n\n## Writing Your First Smart Contract\n\nAt the start of any smart contract or Solidity code you write, always mention the version you want to work with. Right above the version, insert the SPDX license Identifier. If you're unsure about the version to use, you can default to the *MIT license* for the time being.\n\nHere's an example:\n\n```js\n// SPDX-License-Identifier: MIT\npragma solidity >=0.7.0 <0.9.0;[...]\n```\n\nNext, you need to create what is known as a contract object. This contract object constitutes the basic structure of your smart contract. A `contract` in Solidity is somewhat similar to a class in other programming languages, where anything inside the curly brackets `{'{'}...{'}'}` forms part of that contract.\n\n## Types and Structures\n\nSolidity supports multiple types like `uint256`, `string`, `boolean`, `int`, and others. Further, Solidity also allows for the creation of custom types using a feature known as a `struct`.\n\nThough this language might seem foreign, take solace in the fact that Solidity, like other programming languages, supports the creation of arrays (or lists), and mappings (akin to dictionaries or hash tables). As a quick reference, if you provide a key to your mapping, you'll receive the variable associated with that key.\n\n## Functions and Behavior\n\nThe real magic happens when we start creating functions in Solidity that can modify the state of the blockchain. In addition, we can create functions that are \"read-only\", meaning they don’t modify the blockchain’s state - these are known as `view` and `pure` functions.\n\n## Data Locations and Memory\n\nWe can specify different data locations in our parameters. Notice that this only applies to particular types like strings, structs, and arrays. The terms `calldata` and `memory` are used to denote temporary variables that exist only for the duration of a function call. On the other hand, `storage` variables are permanent and remain in the contract forever.\n\nAn important caveat is that function parameters can't be `storage` variables, as they will only exist for the duration of the function call.\n\n## Conclusion\n\nWhen we compile our smart contract, it essentially compiles our Solidity code down to EVM-compatible bytecode (machine-readable code). We will delve into these specifications in later posts.\n\nBut for now, congratulations on making your first step toward creating a contract on the blockchain! Go reward yourself with some ice-cream, an extra cup of coffee, or anything else you fancy. Happy coding!\n",
          "updates": []
        }
      ]
    },
    {
      "sectionId": "bef84d21-e135-4171-bbc1-ac4275da456a",
      "number": 2,
      "title": "Storage Factory",
      "slug": "storage-factory",
      "folderName": "2-storage-factory",
      "lessons": [
        {
          "lessonId": "5fabb153-8853-4b94-9984-d15dfe6501a5",
          "number": 1,
          "title": "Storage factory introduction",
          "slug": "factory-introduction",
          "folderName": "1-factory-introduction",
          "description": "Introduction to deploying and interacting with contracts, focusing on Remix Storage Factory. The lesson involves working with 'SimpleStorage.sol', 'AddFiveStorage.sol', and 'StorageFactory.sol', demonstrating how other contracts can deploy and interact with new contracts.",
          "duration": 4,
          "videoUrl": "mlu8ISV3ZH4",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/1-factory-introduction/+page.md",
          "markdownContent": "---\ntitle: Introduction\n---\n*If you'd like, you can follow along with the course here.*\n\n\n\nWelcome back to our developer tutorial series! We've made our way to lesson three, where we'll dive deeper into the world of contracts, by discussing their deployment and interaction abilities. As always, all the resources for this session can be found in the [Github Repo](https://github.com/Cyfrin/foundry-full-course-f23#lesson-3-remix-storage-factory). For this lesson, we'll focus on the Remix Storage Factory.\n\n\n## What To Expect in This Lesson\n\nIn this session, we'll be working with three new contract files, namely:\n\n1. `SimpleStorage.sol` - we'll be working with a slightly modified version of this Smart Contract,\n2. `AddFiveStorage.sol` - a completely new one for this lesson,\n3. `StorageFactory.sol` - our main character for this lesson.\n\nOur `StorageFactory.sol` will serve as a workshop, creating and deploying new Simple Storage contracts. It's crucial to note that other contracts can indeed deploy new contracts. Beyond deployment, our storage factory will also interact with these freshly minted contracts.\n\n## Diving Deeper Into the Code\n\nBefore we delve into writing code, let's visualize how this whole thing works. We'll take you through these steps with the help of the Remix VM, let's take a look to the main functions we are going to work with.\n\n```js\ncontract simplestorage {\n    function createSimpleStorageContract() public {};\n    function sfStore(uint256 _simpleStorageIndex, uint256 _simpleStorageNumber) public {};\n    function sFGet(uint256 _simpleStorageIndex) public view returns (uint256) {}\n    }\n```\n\nFollow along:\n\n1. Compile our code and deploy to the Remix VM.\n2. Scroll down to choose 'storage factory' from the contract selection.\n3. Now we have deployed this contract.\n\nThe first function is `createSimpleStorageContract()`. We'll trigger this and see a new transaction appear. This transaction shows us deploying a Simple Storage contract from our Storage Factory contract.\n\nAs a bonus, we can interact with our Simple Storage contract via the `Store` function. This function accepts a favorite number input. Let's test this by using the `sfStore` function from our Storage Factory contract. We'll enter `0` as the index for our Simple Storage contract (as we've only deployed one so far), and we'll say our new favorite number is `123`. We'll execute `sfStore` and voila!\n\nNow type `sFGet(0)`, we'll retrieve the favorite number 123 we stored earlier.\n\n\n## Wrapping Up\n\nAside from the storage factory, this lesson is also about introducing you to critical Solidity features such as imports and inheritance. But remember this is just a introduction, we are going to dive on how this contracts works step by step on the next lessons.",
          "updates": []
        },
        {
          "lessonId": "cd198711-c9ff-44fa-825f-3ca72733a5d9",
          "number": 2,
          "title": "Setting the project",
          "slug": "setting-up-the-factory",
          "folderName": "2-setting-up-the-factory",
          "description": "This lesson explores the concept of composability in smart contracts, particularly in DeFi, and introduces the 'StorageFactory' contract that interacts with and deploys the 'SimpleStorage' contract. It covers setting up the StorageFactory contract in Remix and emphasizes the importance of version consistency in Solidity.",
          "duration": 6,
          "videoUrl": "VE4Vq1X24Xs",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/2-setting-up-the-factory/+page.md",
          "markdownContent": "---\ntitle: Setting up\n---\n\n*If you'd like, you can follow along with the course here.*\n\n\n\n\n## What is Composability in Smart Contracts?\n\n<img src=\"/solidity/remix/lesson-3/setting-up/setting-up2.png\" style=\"width: 100%; height: auto;\">\n\n\nOne of the key aspects of blockchain development is the seamless and permissionless interaction among contracts, referred to as composability. This becomes especially important in decentralized finance (DeFi), where intricate financial products interact compatibly using the same smart contract interface.\n\nIn this lesson, we'll be creating a contract titled `StorageFactory` that will interact with and deploy our existing `SimpleStorage` contract.\n\n## Setting Up the StorageFactory Contract\n\nCreating our new contract in Remix follows the same steps we've previously covered. The power of repetition is indeed vastly underrated — and this principle will hold even more merit when we begin working with AI pair programming tools.\n\nThe primary structure of every Solidity smart contract begins with the SPDX License Identifier and the desired version of Solidity expressed as a pragma statement.\n\n```js\n// SPDX-License-Identifier: MITpragma solidity ^0.8.18;\n```\n\nNext, we'll define our contract:\n\n```dart\ncontract StorageFactory {}\n```\n\nOnce your contract is defined, remember to hit `Compile` The caret sign `(^)` before the solidity version implies that any version greater than or equal to 0.8.18 is acceptable.\n\n## Creating and Deploying the SimpleStorage Contract\n\nThe StorageFactory contract needs to deploy a SimpleStorage contract. For it to do this, the StorageFactory contract should know and understand what the SimpleStorage contract is and how it works.\n\nOne way to ensure this is by placing the SimpleStorage contract code within the same file as the StorageFactory. This can be done by copying the SimpleStorage code and pasting it above the StorageFactory contract but below the pragma solidity line.\n\n```dart\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.18;\n\ncontract SimpleStorage {SimpleStorage code here}\n\ncontract StorageFactory {}\n```\n\nThis option does allow for successful compilation, and both contracts can exist within the same file. However, this isn't best practice, especially with larger projects where multiple contracts in a single file can cause confusion and difficulty in code navigation. As a best practice, each contract should reside in its own file.\n\nWhen deploying contracts, if you select Remix VM and scroll down to the `Choose Contract` section, you'll notice that both contracts (SimpleStorage and StorageFactory) appear if the StorageFactory.sol file is open.\n\n<img src=\"/solidity/remix/lesson-3/setting-up/setting-up3.png\" style=\"width: 100%; height: auto;\">\n\nNext, in our StorageFactory.sol file, we'll create a function - `createSimpleStorageContract` that can deploy the SimpleStorage contract.\n\nThe journey of harnessing the full potential of Solidity across these lessons is both challenging and exciting, stay tuned for more updates.\nHappy coding!\n\n<img src=\"/solidity/remix/lesson-3/setting-up/setting-up1.png\" style=\"width: 100%; height: auto;\">",
          "updates": []
        },
        {
          "lessonId": "4e6c8899-247a-480a-9893-1b4d15cbd6b1",
          "number": 3,
          "title": "Deploying a contract from a contract",
          "slug": "deploying-a-contract-from-a-contract",
          "folderName": "3-deploying-a-contract-from-a-contract",
          "description": "The chapter focuses on deploying a Simple Storage contract in Solidity and saving it to a storage or state variable. It covers the syntax for creating a Simple Storage contract within another contract and demonstrates the deployment and interaction process in Remix.",
          "duration": 5,
          "videoUrl": "oiXMEKO5mAE",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/3-deploying-a-contract-from-a-contract/+page.md",
          "markdownContent": "---\ntitle: Deploying a Contract from a Contract (Factory)\n---\n\n*If you'd like, you can follow along with the course here.*\n\n\n\n\nThis chapter covers the process of deploying a Simple Storage contract in Solidity by saving it to a storage or state variable. This will be implemented similarly to saving any variable.\n\n## Understanding the Syntax\n\nLet's begin by recalling an example of assigning a variable: `uint256 public favoriteNumber`. This follows the format `type visibility name`. In our case, we are going to do the exact same thing.\n\nThe type of a Simple Storage contract will be `SimpleStorage`. The contract keyword here is similar to the Struct keyword, allowing us to create a new type.\n\n<img src=\"/solidity/remix/lesson-3/deploying/deploying-4.png\" style=\"width: 100%; height: auto;\">\n\n\nIt is important to point out a syntax frequently used in Solidity and can be confusing for beginners: `SimpleStorage simpleStorage;`. The difference between `SimpleStorage` on the left and `simpleStorage` on the right lies in the case sensitivity. `Simple Storage` refers to the contract type while `simpleStorage` refers to the variable name.\n\n<img src=\"/solidity/remix/lesson-3/deploying/deploying-3.png\" style=\"width: 100%; height: auto;\">\n\n\nYou will often find programmers naming the variable the same way as the contract itself.\n\n## Creating A Simple Storage Contract\n\nWe will go ahead and identify our contract in our `createSimpleStorageContract()` function. To do this, we will assign `simpleStorage = new SimpleStorage();`. Solidity knows to deploy a contract when we use the `new` keyword.\n\nThis code should now succesfully compile. We can proceed to deploy it. Ensure that you are on the storagefactory.sol on the right-hand side, then scroll down to the contract. Now, you should be able to deploy the `StorageFactory`.\n\n## Testing The Deployment\n\nAfter hitting the deploy button, you can observe the transaction visibility in the terminal. You will notice two buttons: a blue `View Function` button, which is there because the public keyword automatically gives the variable name a getter function, and an orange `createSimpleStorageContract` button that corresponds to the transaction.\n\nIf we call the `createSimpleStorageContract` and then call `SimpleStorage` blue view function, the address that appears verifies that our `SimpleStorage` contract has been deployed.\n\n<img src=\"/solidity/remix/lesson-3/deploying/deploy-factory1.png\" style=\"width: 100%; height: auto;\">\n\n\nAnd just like that, you now know how to have a contract deploy another contract. Congratulations on tackling this important aspect of smart contract programming in Solidity. Despite the often subtle and sometimes confusing notation, the process itself is fairly straightforward. Familiarity comes with practice, so keep working with contracts and making deployments!",
          "updates": []
        },
        {
          "lessonId": "2160e3d9-a66b-4f67-a5b8-bb759d5d9e10",
          "number": 4,
          "title": "Solidity imports",
          "slug": "solidity-imports",
          "folderName": "4-solidity-imports",
          "description": "This lesson covers the use of the 'import' statement in Solidity for organizing contract files, managing Solidity versions, and the advanced method of 'named imports'. It demonstrates how importing improves workflow and allows for selective inclusion of contract elements.",
          "duration": 6,
          "videoUrl": "CNDzi1GuWyg",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/4-solidity-imports/+page.md",
          "markdownContent": "---\ntitle: Solidity Imports\n---\n\n*If you'd like, you can follow along with the course here.*\n\n\n\n\nIn this lesson, we will look at a more improved way of organizing your Solidity contract files using the `import` statement, making the task of making any changes in your contract files much simpler. We’ll also address potential issues around consistency in Solidity version between multiple files, and we'll focus primarily on the more advanced import method called `named imports` that you should always use.\n\n## The Immaculate Import\n\nMost programmers are familiar with the concept of import – it's like adding a new tool to your toolbox, allowing you to use code from different files without cluttering your current project file. In Solidity, this is no different.\n\nLet's say we are dealing with two contract files: `SimpleStorage.sol` and `StorageFactory.sol`. Prior to using `import`, you would have to constantly copy-paste your contents of `SimpleStorage.sol` into `StorageFactory.sol` and vice-versa if any changes are made. If you're thinking that's too much work, then you are absolutely right!\n\nInstead, you can just use the `import` statement:\n\n```js\nimport \"./SimpleStorage.sol\";\n```\n\nWith this single line of code, you can effortlessly incorporate `SimpleStorage.sol` into `StorageFactory.sol`, drastically improving your workflow. It's as good as planting the entire `SimpleStorage.sol` within `StorageFactory.sol`, but without the mess.\n\n## Manage Your Solidity Versions\n\nWith multiple contracts in place, a word of caution: be wary of the versions of Solidity you're using. This is crucial because while Remix will automatically adjust the version upwards to ensure compatibility (e.g., bumping `0.8.16` to `0.8.18`), going the other direction can lead to compile errors. Ensuring that you are consistent with your version of Solidity is vital for smooth compiling of all your contracts.\n\n## Named Imports: Your New Best Friend\n\nAlthough the import statement brings a breath of fresh air into your code organization, diving a little deeper will reveal a even better way of handling imports - the named imports.\n\nImagine `SimpleStorage.sol` has multiple contract files (`SimpleStorage2`, `SimpleStorage3`, `SimpleStorage4`) which are quite extensive in size.\n\n```js\nimport \"./simplestorage.sol\"\n```\n\nUsing this statement will import everything from `SimpleStorage.sol`, including all the bulky contract files, leading to a far more expensive deployment of the `StorageFactory.sol`.\n\nHere's where named imports come into play. Named imports allow you to cherry pick the exact contracts you need:\n\n```js\nimport { SimpleStorage } from \"./SimpleStorage.sol\";\n```\n\nEven if your `SimpleStorage.sol` has other contracts, named imports allow you to just import what you need (`SimpleStorage`), thus avoiding any unecessary imports.\n\nIf you need multiple contracts, named imports have got you covered:\n\n```js\nimport { SimpleStorage, SimpleStorage2 } from \"./SimpleStorage.sol\";\n```\n\nNow, this will only import `SimpleStorage` and `SimpleStorage2`, without bringing in any other possibly gargantuan contracts present in your `SimpleStorage.sol` file.\n\nBy sticking to named imports, you're not just making your future coding lives simpler, but you're also staying ahead of the curve. Incredibly, just by employing named imports, you're setting yourself apart, ahead of 80% of current Solidity developers.\n\n## Wrapping Up\n\nNow we've explored a more effective way of managing our Solidity contract files through the use of import statements, understood the need for solidity version management, and learned how to go one step further with named imports. Congratulations, you're now more equipped to organize your code, manage multiple contract files, and make your Solidity programming more efficient and tidy.\n\nRemember, in coding and in life, always aim to be incredibly efficient, even if that means being a little lazy.",
          "updates": []
        },
        {
          "lessonId": "ce675e0a-d6e9-4d32-8201-2882b2c8ef5d",
          "number": 5,
          "title": "Use AI to help pt.1",
          "slug": "ai-help-developing-coding",
          "folderName": "5-ai-help-ii",
          "description": "The lesson discusses utilizing AI chat platforms like ChatGPT and Bard to assist in understanding programming concepts. It emphasizes the importance of formulating questions effectively for AI platforms and provides guidance on using these tools for coding assistance.",
          "duration": 4,
          "videoUrl": "hA2AMEeldx4",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/5-ai-help-ii/+page.md",
          "markdownContent": "---\ntitle: 5-ai-help-ii\n---\n\n\n\n\nWe've all been there. Staring blankly at a line of code and scratching our heads, trying to make sense of it. Sometimes a new concept or technique can trip us up. And it's not really surprising—the world of programming and technology is vast and constantly evolving and, sooner or later, we're bound to hit a roadblock.\n\nBut fret not. Because AI is here to save the day. More specifically, AI chat platforms like **ChatGPT** and **Bard**. They can be a helpful resource to gain clarity when we're navigating the rocky terrain of programming.\n\nHowever, remember that 'how' you ask questions can significantly impact the clarity and effectiveness of the answers.\n\n## Ask Questions the Right Way\n\nLet's say you come across a line of code and can't quite understand the difference between two instances of `SimpleStorage`. Here's how you can formulate a question for the AI:\n\n1. Open ChatGPT or any other AI chatbot platform you prefer.\n2. Start with a simple and straightforward query like:\n   \n    `\"Hi, I'm having a hard time understanding the difference between these simple storages on this line.\"`\n3. Highlight **only the line** you're confused about and copy it.\n4. Paste this line of code within your question in a block format. In markdown, you can create a block by adding three backticks `\"`````\"` before and after the block of text or code.\n\n```\n    ```\n    // paste your line of code here\n    ```\n```\n\nThis signifies that it is a block of code and makes it easier for the AI to understand.\n\n5. If your code is small enough, you can paste the **entire code** as well, but remember to mark it as a code block too. Some AI may struggle to handle large amounts of code, so try to be as concise as possible.\n    \n    Here's an example of how it would look:\n\n```\nHi, I'm having a hard time understanding the difference between these simple storages on this line:\n```\n\n```\n```// paste the confusing line of code here```\n```\n\n```\nHere is my full code:\n```\n\n```\n```// paste the full code here```\n```\n\n\nNow, just hit \"Send\" and let the AI do its magic!## Interpreting AI Responses\n\n<img src=\"/solidity/remix/lesson-3/ai-support/ai-support.png\" style=\"width: 100%; height: auto;\">\n\n\nThe AI can provide insightful answers to help unravel the mysteries of your code. For instance, with the `SimpleStorage` example, an AI may indicate that \"simple storage is a variable of type simple storage, which is a contract defined in simple storage.sol\". If all goes well, this should help clarify any doubts you might have. \n\n> \"A lot of this beginner basic stuff AIS are really good at. As we get more and more advanced, AIs are going to start breaking apart. But at least for the beginning, AIs are going to be incredibly helpful and incredibly good at explaining a lot.\"From the basic to the more advanced stuff, you can lean on the AI chat as a \"learning buddy\".\n\n## Not Always Right\n\nDespite their overwhelming benefits, remember that AI chat platforms are not infallible. They can, and do, get things wrong or misunderstood sometimes. When that happens, don't lose hope! You can engage other platforms like [Stack Exchange](https://ethereum.stackexchange.com/), or the discussion forums related to the course or topic you're studying.For instance, when querying about `SimpleStorage`, an AI response might refer to a 'stored data variable', which doesn't exist in the code you provided. Don't panic! It's just an example of how AI's often work on context-based inference and may sometimes link to unrelated concepts.\n\nStay patient, stay curious, and keep learning!\n",
          "updates": []
        },
        {
          "lessonId": "85b888f4-25c2-43e2-bece-6cfd3a09183b",
          "number": 6,
          "title": "Interacting with contracts ABI",
          "slug": "interacting-with-smart-contracts-abi",
          "folderName": "6-interacting-with-contracts-abi",
          "description": "This lesson teaches how to keep track of contract addresses when deploying new contracts using Solidity's 'new' keyword. It introduces the concept of ABI (Application Binary Interface) for contract interaction and demonstrates how to interact with contracts using ABI and address in Solidity.",
          "duration": 10,
          "videoUrl": "335sMB2GY8w",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/6-interacting-with-contracts-abi/+page.md",
          "markdownContent": "---\ntitle: Interacting with Contracts ABI\n---\n\n\n\nLet's assume that every time we call `createSimpleStorageContract()`, we're deploying a new Simple Storage Contract. But there's a catch – we're not keeping track of all the addresses that this simple storage contract is being deployed to. Let's fix that.\n\n### Solution: A Running List of Contracts\n\nA better approach is to transform our variable into a list or an array of Simple Storage Contracts. This way, whenever a contract is created, it gets added to our list. Renaming the new list as `listOfSimpleStorageContracts` gives us a dynamic array for contract storage.\n\n```dart\n SimpleStorage[] public listOfSimpleStorageContracts;\n```\n\nNow, whenever a new contract is deployed, it gets pushed to this dynamic array.\n\n```js\nfunction createSimpleStorageContract() public {\n        SimpleStorage simpleStorageContractVariable = new SimpleStorage();\n        listOfSimpleStorageContracts.push(simpleStorageContractVariable);\n    }\n```\n\nOnce compiled and deployed you will be able to interact with the contract like so:\n\n```js\nStorageFactory storageFactory = new StorageFactory();\nstorageFactory.createSimpleStorageContract();\n```\n\nOn the deployed contract, you should be able to access `listOfSimpleStorageContracts` which now has a `uint256` input allowing you to choose the index of the variable to interact with.\n\n\n### Interacting with Smart Contracts\n\nOur `StorageFactory` contract can be considered as the manager of all the Simple Storage Contracts. Up next, we'll discuss how our `StorageFactory` contract can call the `store` function of the simple storage that it deploys. To make this happen, we create a function called SF Store.\n\n```js\nfunction sfStore(uint _simpleStorageIndex, uint _simpleStorageNumber) public {...}\n```\n\nWhenever you interact with another contract, you need two things – an address and the ABI (Application Binary Interface). A simple rule of thumb to remember is ABI and address are key for contract interaction. The ABI works like a user manual, guiding code interaction with other contracts.\n\nIf you go to Solidity's compile tab and scroll down, you will find a button to copy the ABI to clipboard. This ABI provides compilation details and helps define how to interact with the contract.\n\nEssentially, the buttons you see upon deploying a contract are the same as the ones you see inside the ABI. The presence and quantity of buttons is determined by the ABI.\n\n<img src=\"/solidity/remix/lesson-3/interacting/interacting-contract1.png\" style=\"width: 100%; height: auto;\">\n\n\nIn our case, the ABI is automatically known to the compiler because the compiler generates it for Solidity. We also know the address because we have a list of all of them. Now, with the ABI and the address at our disposal, we can interact with other contracts with ease.\n\nLet's use the `SFstore` function to store a new number on one of those simple storage contracts using the index in our array:\n\n```js\nlistOfSimpleStorageContracts[_simpleStorageIndex].store(\n            _simpleStorageNumber\n        );\n```\n\nIt is also possible to retrieve the stored value from our Simple Storage contract:\n\n```js\nfunction sfGet(uint256 _simpleStorageIndex) public view returns (uint256) {\n        // return SimpleStorage(address(simpleStorageArray[_simpleStorageIndex])).retrieve();\n        return listOfSimpleStorageContracts[_simpleStorageIndex].retrieve();\n    }\n```\n\nAfter compiling these newly added features and deploying the contract, you will be able to interact with your contract in the expected manner:\n\n\n\nIn conclusion, we have built a contract `StorageFactory` that creates `SimpleStorage` contracts and allows for interaction (saving and retrieving data) with these contracts. As a final touch, we can simplify the `SfGet` and `sfStore` functions as below:\n\n```js\n function sfStore(\n        uint256 _simpleStorageIndex,\n        uint256 _simpleStorageNumber\n    ) public {\n        \n        listOfSimpleStorageContracts[_simpleStorageIndex].store(\n            _simpleStorageNumber\n        );\n    }\n```\n\nBy leveraging the capacities of the Solidity language, we can construct and manage a dynamic array of contracts, and interact with them seamlessly. Keep exploring and happy coding!\n\n<img src=\"/solidity/remix/lesson-3/interacting/interacting-contract2.png\" style=\"width: 100%; height: auto;\">\n",
          "updates": []
        },
        {
          "lessonId": "f8e837c4-c9c8-4a26-925a-f82d341ea7e4",
          "number": 7,
          "title": "Inheritance in Solidity",
          "slug": "inheritance-in-solidity-smart-contracts",
          "folderName": "7-inheritance-in-solidity",
          "description": "An introduction to inheritance and overriding in Solidity, showcasing how to extend the functionality of a contract without duplicating it. The lesson involves creating a new contract 'addFiveStorage.sol' that inherits from 'SimpleStorage.sol' and overrides its functions.",
          "duration": 7,
          "videoUrl": "W8spUsFl0UA",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/7-inheritance-in-solidity/+page.md",
          "markdownContent": "---\ntitle: Inheritance in Solidity\n---\n\n\n\n\nIn past lessons, we have been using a simple storage contract designed to store a user's favorite number. While we understand that it's amazing, what if we want to expand its functionality a bit?\n\nSuppose we want our contract to not only store users favorite numbers but also to add five to each favorite number stored. We could duplicate the entire contract and make changes to the new version, but as an efficient programmer, I'd say we should look for a smarter way to achieve this functionality.\n\nIn this blog, we are going to get introduced to inheritance and overriding in Solidity — two concepts that offer cleaner, clearer, and more reusable code.\n\nLet's create a new file for our enhanced contract and label it `addFiveStorage.sol`. We will again include the [SPDX license identifier](https://spdx.org/licenses/MIT.html) and specify the Solidity version.\n\nA typical new contract would look like this:\n\n```js\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.18;\ncontract AddFiveStorage {}\n```\n\n### Leveraging Inheritance\n\nAs much as we are tempted to copy-paste all of our prior contract's content into the new `addFiveStorage.sol`, we will resist the temptation. This is where inheritance comes into play.\n\nInheritance allows `AddFiveStorage` contract to be a child contract of the `SimpleStorage` contract. Hence, `AddFiveStorage` will be able to perform all tasks performed by `SimpleStorage` and even more.\n\nFirst, we import `SimpleStorage.sol` into `addFiveStorage.sol` using Solidity's named imports:\n\n```js\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.18;\nimport \"./SimpleStorage.sol\";\n\ncontract AddFiveStorage is SimpleStorage {}\n```\n\nThe `is` keyword indicates inheritance, demonstrating the relationship between `AddFiveStorage` and `SimpleStorage`. After successful compilation and deployment, you will notice that `AddFiveStorage` has the same buttons as `SimpleStorage` because it inherited all of `SimpleStorage`'s functionality.\n\n### Implementing Overriding\n\nOverriding allows us to customize functions in `AddFiveStorage.sol` that have already been defined in `SimpleStorage.sol`.\n\nTake a look at the following code snippet:\n\n```js\nfunction store(uint256 _newFavNumber) public {}\n```\n\nIf we attempt to compile this, an error will occur saying there is an overriding function without an override specifier.\n\n> *Type error: Overriding function is missing \"override\" specifier.*\n\nTo resolve this, add the `override` keyword:\n\n```js\nfunction store(uint256 _newFavNumber) public override {// function body}\n```\n\nYet, another error will pop up:\n\n> *CompileError: Trying to override a non-virtual function.*\n\nTo solve this, we will have to mark the `store` function in `SimpleStorage.sol` as `virtual`, allowing it to be overridable:\n\n```js\nfunction store(uint256 favNumber) public virtual {// function body}\n```\n\nNow back to `AddFiveStorage.sol`, let's add our preferred functionality to the `store` function:\n\n```js\nfunction store(uint256 _newFavNumber) public override {\n    favoriteNumber = _newFavNumber + 5;\n    }\n```\n\nSo, we have used inheritance to adopt code from the `SimpleStorage` contract, and we have overridden the `store` function to customize its functionality.\n\n\n### Wrapping Up\n\nAfter deploying your new contract and attempting to store the number `2`, you will find that the stored number, upon retrieving, will be `7`. This confirms that our `store` function in `AddFiveStorage` contract is overriding the `store` in `SimpleStorage` as is adding `5` to each number stored.\n\nAs demonstrated in this lesson, taking advantage of inheritance and overriding not only simplifies our work but also harnesses the power of OOP in Solidity. Happy coding!",
          "updates": []
        },
        {
          "lessonId": "87b15470-d532-41fc-93e6-05277b0a79b1",
          "number": 8,
          "title": "Sections summary and recap",
          "slug": "summary-and-recap",
          "folderName": "8-summary-and-recap",
          "description": "A summary and recap of the lessons covering deploying contracts using the 'new' keyword, importing contracts, named imports, interacting with contracts using ABI, and contract inheritance in Solidity. The lesson celebrates progress made and encourages continued learning.",
          "duration": 2,
          "videoUrl": "mwOTR_2Rv4U",
          "rawMarkdownUrl": "/routes/solidity/2-storage-factory/8-summary-and-recap/+page.md",
          "markdownContent": "---\ntitle: Summary and Recap\n---\n\n\n\n\n## Deploying contracts using new keyword\n\nOne of the initial things we explored is how to deploy contracts from other contracts using the `new` keyword. Solidity enables us to clone existing contracts and produce new ones on the fly. This feature allows developers to deploy multiple instances of a contract without manually copy-pasting code – a handy tool, particularly for applications with multiple contract instances.\n\n## Importing other contracts\n\nBeyond deploying contracts from within contracts, Solidity also equips us with the capability to import other contracts. Essentially, importing contracts is equivalent to copying and pasting the code into a file. This feature enhances reusability and modularity of code. A sample of importing contracts can be represented as:\n\n```js\nimport './myOtherContract.sol';\n```\n\n## Named Imports\n\nIn the journey of mastering Solidity, we also encountered the nifty concept of 'Named Imports'. Named imports can help make your code more organized and easier to read. They're going to elevate your coding game and make you shine among other Solidity devs out there.\n\n```js\nimport { Contract as MyContract } from './myOtherContract.sol';\n```\n\n## Interacting with contracts\n\nSolidity enables interaction with other contracts, given that we have the contract's address and its Application Binary Interface (ABI). In our tutorial, we realized that the `simple storage` type conveniently provides both the address and the ABI, simplifying our interaction with it.\n\n```js\nSimpleStorage storage = SimpleStorage(address);\nuint256 storedData = storage.retrieve();\n```\n\nAs of now, we haven't delved too much regarding ABIs. However, in subsequent sections, we will explore more about ABIs\n\n## Contract Inheritance\n\nSolidity also offers a powerful feature in the form of contract inheritance. If you want to create a child contract and inherit the features of another contract, import the parent contract and use the `is` keyword.\n\nTo override a function of the base class, the `override` keyword is used. But the base (parent) class must tag the function we want to override with the `virtual` keyword. The syntax can be represented as below:\n\n```js\nimport './BaseContract.sol';\ncontract ChildContract is BaseContract {\n    function foo() public override { Override functionality here}\n    }\n```\n\n\n\n### Celebrating Progress\n\nAnd that's it! You've made it to the end of this section. By now, you've acquired some potent capabilities in Solidity. So take a moment to give yourself a resounding pat on the back! Embrace a well-deserved break because taking mental pauses is good for your cognitive health. Go for a walk, indulge in a cup of coffee or some ice cream, or better yet, share your achievements with your friends be it in person or across the world via social media.\n\nRemember, each stride you make in mastering Solidity is a significant one. So be sure to celebrate these crucial little wins that keep you excited and fuel your curiosity.\n\nKeep learning, keep coding, and above all, keep pushing the boundaries.\n\n*Congratulations! You have successfully completed Lesson 3 of the Solidity Course.*",
          "updates": []
        }
      ]
    },
    {
      "sectionId": "6f3abd80-e461-4abd-9e21-03d93d5da5ba",
      "number": 3,
      "title": "Fund Me",
      "slug": "fund-me",
      "folderName": "3-fund-me",
      "lessons": [
        {
          "lessonId": "972a84be-9bff-4730-8c17-3a75979eeef1",
          "number": 1,
          "title": "Fund me introduction",
          "slug": "fund-me-intro",
          "folderName": "1-fund-me-intro",
          "description": "Introduction to decentralized crowdfunding contract 'FundMe.sol', allowing users to send native blockchain cryptocurrency, with the owner being able to withdraw the funds. The lesson covers deploying on a testnet and handling transactions in Ethereum, Polygon, or Avalanche.",
          "duration": 4,
          "videoUrl": "Ghmze8sh34M",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/1-fund-me-intro/+page.md",
          "markdownContent": "---\ntitle: Introduction\n---\n\n*Follow along the course with this video.*\n\n\n\n\nHello everyone, I’m glad to have you back with us for Lesson 4 in our Web3 Development series. This time we’re diving headfirst into **FundMe.sol**, our very own decentralized crowdfunding contract.\n\n## Breaking Down The Contracts\n\nIn this lesson, we'll be creating one main contract - **FundMe.sol**. However, we'll also use another file called **PriceConverter.sol** which we will discuss later.\n\n<img src=\"/solidity/remix/lesson-4/introduction/intro-fundme1.png\" style=\"width: 100%; height: auto;\">\n\nOur **FundMe contract** is a perfect example of a crowdfunded project. Think of it as your very own decentralized `Kickstarter`, where users can send any native blockchain cryptocurrency. It allows the owner of the contract to withdraw all the funds collected for their new project. It is designed so that it can be deployed on a **testnet**. \n\n\n<img src=\"/solidity/remix/lesson-4/introduction/intro-fundme2.png\" style=\"width: 100%; height: auto;\">\n\n\nOnce deployed, you will see a set of buttons along with a new **red button** named **Fund**. The red button is a giveaway that the function is payable where you can send native Ethereum, Polygon, Avalanche, or any other native blockchain currency.\n\n\n**Remember**: Fund function is payable. You can send native Ethereum, Polygon, Avalanche, or any other native blockchain currency.\n\nTo transfer funds, navigate to the **value section** of the contract user interface then hit **'Fund'**. Following this, your connected wallet (e.g., Metamask) will open for you to confirm the transaction. During this transaction, the contract balance in the functional section will show zero until the fund transfer process completes.\n\nOnce the transaction has completed, the contract balance will update to display the transferred amount. The contract owner can then withdraw the funds.\n\n### Practically Speaking....\n\nWe can go through the process using 0.1 ether as an example. After input the amount to be sent, and hit the `fund` button, confirm the transaction using my connected wallet (in this case, MetaMask), and the balance of the contract will show as zero. After a while, once the transaction has been completed, we will see a balance of 0.1 ETH appearing on Etherscan and Remix. The slight delay merely reflects transaction processing times.\n\nFollowing this, we can give permission to the contract owner to withdraw the funds. Since in this case, we are also the owner of the contract, the balance will be transferred back into our account. The balance can also be returned to MetaMask if kept open for long enough. \n \n## Wrapping Up \n\nAnd that's it! Once you complete this section, you would have grasped most of the fundamentals of working with Solidity! So keep watching this lesson chapters and get learn how to implement this `FundMe` contract yourself step by step.\n\nBe sure to write down any questions you may have and direct them towards our GitHub discussions thread.\n\nReady to get started? Let's jump back in!",
          "updates": []
        },
        {
          "lessonId": "dab8c9d9-9cde-4765-96f1-2f6f09a744c0",
          "number": 2,
          "title": "Project setup",
          "slug": "setup",
          "folderName": "2-setup",
          "description": "This lesson guides through the initial steps in coding the 'FundMe' contract, which allows users to send funds and an owner to withdraw them. It involves setting up the Remix IDE workspace, outlining the contract functions, and focusing on the 'fund' function.",
          "duration": 2,
          "videoUrl": "_chLEeWR210",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/2-setup/+page.md",
          "markdownContent": "---\ntitle: Project Set up\n---\n*Follow along this chapter with the video bellow*\n\n\n\nOn this chapter, we are going to delve into the heart of the Ethereum Blockchain - smart contracts. We'll start to code 'FundMe.' It will be a simple contract that allows users to send funds into it, and later, an owner can withdraw the funds from it. But you already know that, let's start by cleaning up our Remix IDE workspace.\n\n### **1. Preparing our Remix IDE workspace**\n\nOpen your [Remix IDE](https://remix.ethereum.org/) and delete all preexisting contracts to start afresh. You might find contracts named simple storage, add five extra, storage factory, etc., from our previous lesson posts. Just right-click each one and select 'delete.' Make sure your workspace is clear before moving to the next step. Also, you can just create a new workspace and leave the previous contracts for reference purposes. Remember tough that if you delete the cookies and history on your browser, you will lose all your previous work.\n\n\nNow let's get down to business and start creating our contract. You can name it 'FundMe.' A valuable tip for any coding process is to first write down what you want your code to achieve in plain English.\n\nFor our 'FundMe' contract, we primarily want it to perform three tasks:\n\n1. **Allow users to send funds into the contract:** A standard function in any fundraising platform; users should be able to donate funds into the 'FundMe' contract.\n2. **Enable withdrawal of funds by the contract owner:** The contract owner, or whoever has control over the 'FundMe' contract, should be able to withdraw the accumulated funds.\n3. **Set a minimum funding value in USD:** There should be a lower limit for donations to prevent negligible amounts—e.g., a penny.\n\nNow, armed with these guidelines, we'll start building the contract. Start by declaring the SPDX license identifier and the solidity version:\n\n```js\n// SPDX-License-Identifier: MIT\npragma solidity ^0.8.18;\ncontract FundMe {}\n```\n\n### **3. Outlining the Contract Functions**\n\nBefore diving into the nitty-gritty of our code, let's lay down the functions we aim to implement for our contract functionality. Two primary functions will form the backbone of our 'FundMe' contract:\n\n1. **`fund`:** This function will facilitate the donation of funds into the contract by users.\n2. **`withdraw`:** This function will enable the contract owner to extract the funds that have been donated.\n\nThese functions will represent the main interaction points with our contract. We may add more features later, but for now, we'll establish these two at the core of our contract.\n\nBut coding everything at once can be overwhelming, especially for large projects. Thus, best practice dictates that we comment out the `withdraw` function and pay singular attention to building the `fund` function.\n\n```js\ncontract FundMe {\n    // users will use this function to send funds into our contract\n    function fund() public {code here}\n    // Function for owner to withdraw funds\n    /*function withdraw() public {// code for the `withdraw` function will go here}*/}\n```\n\nThat's all for this post. Join us in the next one as we delve into crafting the `fund` function and give life to our 'FundMe' contract.\n\n<img src=\"/solidity/remix/lesson-4/setup/setup1.png\" style=\"width: 100%; height: auto;\">\n",
          "updates": []
        },
        {
          "lessonId": "43475ec4-ae9d-465f-b8dc-b45353801e56",
          "number": 3,
          "title": "Sending ETH through a function",
          "slug": "sending-eth-through-a-function",
          "folderName": "3-sending-eth-through-a-function",
          "description": "This chapter explains how to create a function in a smart contract that requires a minimum amount of Ethereum (ETH) to be sent",
          "duration": 5,
          "videoUrl": "-jOiNJIRdz0",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/3-sending-eth-through-a-function/+page.md",
          "markdownContent": "---\ntitle: Sending ETH trough a function\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n\nIn this chapter, we'll explore how to establish a mechanism that enables users to send Ethereum (ETH) to a smart contract. Specifically, we'll create a function that requires a minimum amount of ETH.\n\n## How Does the Transaction Work?\n\nWhen a transaction on the blockchain occurs, a value field is always populated. This field represents the quantity of native blockchain cryptocurrency sent in each transaction. For instance, when the value field in a transaction between our accounts was populated through MetaMask, it indicated the amount of ETH being transferred.\n\n\n## Enabling Our Function to Accept Cryptocurrency\n\nFor our function to be able to receive the native blockchain currency, we need to make the function 「payable」. In Solidity, this is accomplished using the keyword `payable`. This keyword turns the function red in the Remix UI, signifying that it can accept cryptocurrency.\n\n```js\nfunction fund() public payable{...}\n```\n\n## Holding Funds in Contract\n\nJust as wallets hold funds, contracts can serve a similar role. Following deployment, a contract behaves almost identically to a wallet address. It can receive funds, interact with them, and as seen in our demo, the contract can amass a balance akin to a wallet.\n\n<img src=\"/solidity/remix/lesson-4/transact/transact1.png\" style=\"width: 100%; height: auto;\">\n\n\n## Transaction Value - The Message Value\n\nThe value amount of a transaction can be accessed using the `message value` global in Solidity.\n\n```javascript\nmsg.value\n```\n\nThis represents the number of 'wei' sent with the message. Here, 'wei' is the smallest denomination of ETH.\n\n## Implementing Requirements for Transactions\n\nTo enforce a minimum threshold of one ether sent via our function, we can utilize the `require` keyword.\n\n```javascript\nrequire(msg.value > 1 ether);\n```\n\nThis essentially ensures that the transaction only proceeds if at least one ether is contained within the value field. If the requirement isn’t met, the transaction reverts.\n\nShould we wish to offer more context to the user, we can supplement the require statement with a custom error message.\n\n```javascript\nrequire(msg.value > 1 ether, \"Didn't send enough ETH\");\n```\n\nAn online tool like [Ethconverter](https://eth-converter.com/) can be useful for converting between ether, wei, and Gwei (another denomination of ether).\n\n## Reverting Transactions\n\nIf a user attempts to send less than the required amount, the transaction will fail and a message will be displayed. For instance, if a user attempts to send 1000 wei, which is significantly less than one ether `(1 x 10^18 wei)`, the transaction will not proceed.\n\nTo demonstrate this, see the example below where the user is attempting to send `3000000` wei:\n\n<img src=\"/solidity/remix/lesson-4/transact/transact2.png\" style=\"width: 100%; height: auto;\">\n\nAs you can see, the require statement has the power to control the behavior of the transaction. If the condition set is not satisfied, it reverts the transaction with the provided error message. This guarantees our contract gets the minimum amount of ETH required.\n\nBy understanding how to enforce payment requirements, you gain more control over the behavior and security of your contracts. Continue exploring Solidity's capabilities to build amazing Smart Contract, let's continue with the next lesson.",
          "updates": []
        },
        {
          "lessonId": "265a0fdd-801d-46cd-bc4b-c1fb65468812",
          "number": 4,
          "title": "Solidity reverts",
          "slug": "solidity-reverts",
          "folderName": "4-solidity-reverts",
          "description": "The lesson focuses on understanding 'reverts' and 'gas' in Ethereum transactions. It covers the concept of reverting transactions, checking gas usage, and how gas is used and refunded in failed transactions. The lesson also explores transaction fields and gas limits.",
          "duration": 4,
          "videoUrl": "DzapsA5NQyc",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/4-solidity-reverts/+page.md",
          "markdownContent": "---\ntitle: Solidity Reverts and Gas\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n<!-- <img src=\"/solidity/remix/lesson-4/transact/transact2.png\" style=\"width: 100%; height: auto;\"> -->\n\n\n# Understanding Reverts and Gas in Ethereum Blockchain\n\nIn this lesson will emphasize **reverts** and how **gas** works in transactions.\n\n## What is a Revert?\n\nReverts can at times be confusing and appear tricky. A revert, in essence, undoes previous actions, sending back the remaining gas associated with that transaction. But what does this mean in context?\n\nLet's illustrate this with an example using our `FundMe` contract. Here's some code to start with:\n\n```javascript\n    uint256 public myValue;\n    myValue = 1;\n    function fund() public {\n        myValue = myValue + 2;\n    }\n```\n\nIn our `fund` function, we increase `myValue` by two each time it executes successfully. However, if we encounter a revert statement, the previous action (where we added two to `myValue`) is undone and `myValue` is reset to its original state.\n\n<img src=\"/solidity/remix/lesson-4/reverts/revert1.png\" style=\"width: 100%; height: auto;\">\n\n\nThis means that if the transaction reverts, `myValue` returns to its previous value (in this case, one). Although technically, the line `myValue = myValue + 2;` was executed, the reverting line following it ensures this change never gets confirmed.\n\n## Checking the Gas Usage\n\nNow arises an important question – will the gas used in the transaction be refunded if my transaction didn't go through because it reverted? Unfortunately, no. If a transaction fails, you still consume the gas because computers executed the code before the transaction reverting.\n\n\nUsers, however, can specify how much gas they're willing to allocate to a transaction. For instance, if a function contained lines of computation after the `require` line, a significant quantity of gas would be needed to operate and run this function. However, if a revert is encountered midway, the unused gas is refunded to whoever initiated the transaction.\n\nHere's a simple rule of thumb:\n\n<img src=\"/solidity/remix/lesson-4/reverts/revert2.png\" style=\"width: 100%; height: auto;\">\n\n## A Look at Transaction Fields\n\n<img src=\"/solidity/remix/lesson-4/reverts/revert3.png\" style=\"width: 100%; height: auto;\">\n\n\nEvery transaction includes specific fields, such as nonce (transaction count for the account), gas price, gas limit (seen on Etherscan), the recipient's address, the transaction value, and data. The data field holds the function call or contract deployment information. These transactions also include cryptographic elements in the V, R, and S fields.\n\nIf sending value, the gas limit is typically set to 21,000, the data field remains empty, and the recipient's address is filled in.\n\n\n<img src=\"/solidity/remix/lesson-4/reverts/revert4.png\" style=\"width: 100%; height: auto;\">\n\n\nIn the Remix Ethereum IDE, values can be set in Wei, Gwei or Ether units. Each Ether is worth `1,000,000,000,000,000,000` Wei or `1,000,000,000` Gwei.\n\n## Conclusion\n\nWhile reverts and gas may seem tricky and can at times be confusing, they help uphold the integrity of the blockchain and its state.In sum, reverts validate integrity by reversing transactions when failures occur. Gas powers transactions, running the EVM, and even when transactions fail, the gas used is not recoverable. To manage this, Ethereum allows users to set the maximum amount of gas they're willing to use for transactions.\n\nLet's keep learning with the next lesson!",
          "updates": []
        },
        {
          "lessonId": "0640be76-d633-468b-b959-feb7ad8e9be9",
          "number": 5,
          "title": "Intro to oracles - getting real world price data",
          "slug": "real-world-price-data",
          "folderName": "5-real-world-price-data",
          "description": "This lesson introduces the concept of decentralized oracles and Chainlink for getting real-world price data into smart contracts. It explains how to update contracts for currency conversion, use Chainlink data feeds, and discusses Chainlink's role in blockchain oracles.",
          "duration": 15,
          "videoUrl": "PhVv8xjexoY",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/5-real-world-price-data/+page.md",
          "markdownContent": "---\ntitle: Real World Price Data\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n\nWith the advancement of blockchain technology and the increasing integration of decentralized finance (DeFi) platforms, the need to accommodate a range of digital currencies has exploded. Allowing users to transact in their preferred digital coinage not only enhances the user experience, but also broadens the market reach of your platform. This lesson will walk you through the steps to adding currency conversion features and setting price thresholds in your smart contracts with Chainlink Oracle, a decentralized network for external data.\n\n<img src=\"/solidity/remix/lesson-4/datafeeds/datafeed1.png\" style=\"width: 100%; height: auto;\">\n\n\n## Updating Our Minimal Contract\n\nCurrently, our contract is too simplified. It requires the message value to exceed one full Ethereum (ETH). If we want our users to spend a minimum of $5 instead of one ETH, we will need to update our contract. To specify this new value, add the line `uint256 minimumUSD = 5` at the top of your contract. To make this value public, replace `internal` with `public`. You can optimize this `minimumUSD` later on for a more gas-efficient contract.\n\nFor the `fund` function within the contract, change the condition to check if the message value meets or exceeds `minimumUSD`. However, we face a roadblock here. The `minimumUSD` value is in USD while the message value is in terms of ETH. This is the part where we introduce *Oracles*, particularly *Chainlink*, into our code.\n\n## Understanding Decentralized Oracles and Chainlink\n\nIn the financial markets, the USD price of assets like Ethereum is externally assigned and does not originate from the blockchain technology itself. Abstracting this price information requires a bridge between the off-chain and on-chain data, which is achieved by using a *decentralized Oracle network* or an Oracle.\n\n<img src=\"/solidity/remix/lesson-4/datafeeds/datafeed2.png\" style=\"width: 100%; height: auto;\">\n\n\nBlockchain exists in a vacuum, ignorant of real-world data and occurrences. It doesn't inherently know the value of ETH or other external data like the weather or a random number. This limitation is due to its deterministic nature that allows all nodes to reach a consensus without diverging or causing conflicts. Attempting to introduce external and variable data or results of API calls will disrupt this consensus, resulting in what is referred to as a *smart contract connectivity issue* or *the Oracle problem*.\n\n## Chainlink and Blockchain Oracles\n\nIn order for our smart contracts to replace traditional understandings of agreement, they must be able to interact with real-world data. This is achievable with Chainlink and blockchain Oracles. A blockchain Oracle serves as a device that broadcasts off-chain data or computations to the smart contracts.\n\nIt's not enough to cascade data through a centralized Oracle because that reintroduces failure point. Centralizing our data source contradicts our goal of decentralization and potentially jeopardizes the trust assumptions that are vital to the operations of blockchains. Consequently, centralized nodes make poor sources for external data or computation capacity. Chainlink provides a solution to these centralized problems.\n\n## How Chainlink Works\n\nChainlink is a modular, decentralized Oracle network that enables the integration of data and external computation into our smart contracts. As mentioned earlier, hybrid smart contracts are highly feature-rich and powerful applications that combine on-chain and off-chain data.\n\nWith Chainlink, we discard the idea of making HTTP calls on blockchain nodes to an API endpoint. These nodes cannot make HTTP calls without breaking consensus. Instead, we assign a network of decentralized Chainlink Oracles the job of delivering data to our smart contracts.\n\nChainlink networks offer flexibility in that they can be configured to deliver any data or execute any external computation at will. Although it requires some work to achieve this level of customization, Chainlink offers ready-made features that can be added to your smart contract applications. Let's go over these features.\n\n## Chainlink Data Feeds\n\nResponsible for powering over $50 billion in the DeFi world, Chainlink data feeds are arguably the most utilized feature. This network of Chainlink nodes sources data from various exchanges and data providers, with each node independently evaluating the asset price.\n\nThey aggregate this data and deliver it to a reference contract, price feed contract, or data contract in a single transaction. These contracts contain the pricing information that powers DeFi applications.\n\n\n\n## Chainlink Verifiable Randomness Function (VRF)\n\nNext up is the Chainlink VRF, a solution for generating provably random numbers. This feature ensures fairness in applications, randomizing NFTs, lotteries, gaming, and more within the blockchain environment. These numbers can't be manipulated as they are determined outside of the blockchain.\n\n<img src=\"/solidity/remix/lesson-4/datafeeds/datafeed3.png\" style=\"width: 100%; height: auto;\">\n\n\n## Chainlink Keepers\n\nAnother great feature is Chainlink's system of keepers—nodes that listen to a registration contract for specific events. Upon detection of triggers that have been programmed into the contract, these nodes perform the intended actions.\n\nFinally, *Chainlink Functions* offer an extreme level of customization—it allows making API calls in a decentralized context. It can be used to create novel applications and is recommended for advanced users who have a deep understanding of Chainlink.\n\n## Conclusion\n\nIntegrating currency conversion and setting a price threshold in your smart contract is made easy with Chainlink. This decentralized Oracle network not only addresses the 'Oracle problem', but provides a suite of additional features for enhancing your dApp capabilities. With Chainlink, you can create a more user-friendly experience for your blockchain platform users.\n\nWe look forward to seeing you unleash the true potential of your smart contracts and how to implement Chainlink in your dApps.",
          "updates": []
        },
        {
          "lessonId": "5883e116-4ba3-4df1-8721-ebf022f9029c",
          "number": 6,
          "title": "Mid section recap",
          "slug": "mid-section-recap-fund-me",
          "folderName": "6-mid-lesson-recap",
          "description": "A recap of key concepts covered so far, including marking functions as payable for transactions, using 'require' statements, handling values with 'msg.value', and integrating external data using Chainlink for accurate real-world asset pricing in smart contracts.",
          "duration": 5,
          "videoUrl": "BnwxhJsa7so",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/6-mid-lesson-recap/+page.md",
          "markdownContent": "---\ntitle: Mid Lesson Recap\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\n<!-- <img src=\"/solidity/remix/lesson-4/datafeeds/datafeed3.png\" style=\"width: 100%; height: auto;\"> -->\n\nJust before we get deeper, let's do a quick review of what we have covered so far. We understand we haven't written that much code, but we've definitely gone over a ton of concepts. We've learned about native blockchain tokens such as Ethereum, as well as crucial elements to incorporate in your smart contract, like marking a function as payable whenever there is a need to receive native blockchain token in a function, among others.\n\n## Payable and Required Statements in Smart Contract Functions\n\nIn the decentralized world of blockchain, a transaction does not just occur. This is especially true when you want to force a transaction to do something specific or want it to fail under certain circumstances. One of the requirements for a function to receive a native blockchain token such as Ethereum is to mark it as payable. Here is a simple yet illustrative code showing how to make a function payable.\n\n```js\nfunction deposit() public payable {\n    balances[msg.sender] += msg.value;\n}\n```\n\nThe critical bit here is `payable`, which allows the function to accept Ethereum as part of the process. Remember, the function must be marked `payable` in order to receive ether in a transaction.\n\n<img src=\"/solidity/remix/lesson-4/midlesson/midlesson1.png\" style=\"width: 100%; height: auto;\">\n\nBut what happens when you would like an operation to fail if a particular condition is not met? This is where `require` statements come in handy. For instance, when making a bank transfer, we want the operation to fail if the sender does not have enough balance. Here's an example;\n\n```js\nfunction transfer(address recipient, uint amount) public {\n    require(balances[msg.sender] >= amount);\n    balances[msg.sender] -= amount;\n    balances[recipient] += amount;\n}\n```\n\nIn this piece of code, if the condition `balances[msg.sender] >= amount` is not met, the transaction will revert. This literally means the operation undoes any work it previously did and returns the initially used gas to the user. In other words, `require` can be viewed as a gatekeeper, only allowing transactions to proceed when certain conditions are met.\n\nMoreover, obtaining values sent with a transaction is achieved via the solidity global `msg.value` property. This comes in handy when you need to handle values within a transaction context.\n\n## Integrating External Data with Chainlink\n\nChainlink is a revolutionary technology for getting external data and computation into our smart contracts. It provides a decentralized way of injecting data into your smart contract which is particularly useful for assets whose values change over time. For instance, if your smart contract deals with real-world assets such as stocks or commodities, obtaining real-time pricing information is crucial.\n\nThis is where the Chainlink data feeds or Chainlink price feeds come in. It helps in sourcing this pricing information in a decentralized manner — hence reflecting the real-world fluctuation of asset prices in your smart contracts.\n\n<img src=\"/solidity/remix/lesson-4/midlesson/midlesson2.png\" style=\"width: 100%; height: auto;\">\n\nTo illustrate this, let's consider that we are building a smart contract that deals with commodities like Gold. Chainlink price feeds can give real-time gold prices, allowing your smart contract to reflect the real world market prices.\n\n```js\nimport \"@chainlink/contracts/src/v0.6/interfaces/AggregatorV3Interface.sol\";\ncontract GoldPriceContract {\n    AggregatorV3Interface internal priceFeed;\n    //The Chainlink price feed contract address\n    constructor() public {priceFeed = AggregatorV3Interface(0x8468b2bDCE073A157E560AA4D9CcF6dB1DB98507);}\n    // Get the latest gold price\n    function getLatestGoldPrice() public view returns (int) {\n        (,int price,,,) = priceFeed.latestRoundData();\n        return price;\n        }\n    }\n```\n\nIn this example, Chainlink feeds are used to query the latest price of Gold. It can then be used in a more complex calculation according to the logic of your contract.\n\nTo summarise, Chainlink is a tool that broadens the capabilities of smart contracts by enabling access to real-world data and computations. By learning how to use it, it's easy to see that the potential applications for smart contracts are virtually limitless!\n",
          "updates": []
        },
        {
          "lessonId": "da69799d-656b-4681-85c8-1783021913cc",
          "number": 7,
          "title": "Solidity interfaces",
          "slug": "solidity-smart-contract-interfaces",
          "folderName": "7-interfaces",
          "description": "This lesson delves into using Solidity interfaces for converting Ethereum into USD and interacting with contracts. It explains how interfaces work, the importance of contract addresses and ABIs, and demonstrates interfacing with the Chainlink Aggregator V3 for price feeds.",
          "duration": 7,
          "videoUrl": "4tTBhEYgm-E",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/7-interfaces/+page.md",
          "markdownContent": "---\ntitle: Interfaces\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n\nMaking transactions with Ethereum has become quite straightforward. But converting Ethereum into dollars or other currencies is where things get a little tricky. So today, we're going to take a deep dive into converting Ethereum into USD and interacting with other contracts lodged within the Ethereum blockchain.\n\n## Converting Ethereum into USD\n\nWhen it comes to determining whether the amount of Ethereum sent via a transaction meets a minimum USD value (e.g., $5), the conversion from Ethereum into USD becomes necessary. This conversion requires us to identify the price of Ethereum (or any other native blockchain token we're working with) in terms of USD; after which, we apply a conversion rate to ascertain its USD equivalent.\n\nNow, let’s see how to implement these steps in code.\n\n```js\n    // Function to get the price of Ethereum in USD\n    function getPrice() public {}\n    // Function to convert a value based on the price\n    function getConversionRate() public {}\n```\n\nThe two functions we're going to create here, `getPrice()` and `getConversionRate()`, will serve our purposes. For the time being, we're making them public so we can easily test, play with, and fine-tune them as we see fit.\n\n## Leveraging Chainlink for Ethereum Prices\n\nOur primary source for Ethereum prices will be a Chainlink data feed. Chainlink documentation provides a basic example written in Solidity that demonstrates how to interact with their price feed. Take a look at it [here](https://docs.chain.link/docs/get-the-latest-price/).\n\nThis example makes use of the `latestRoundData` function of a contract at a given address, returning a multitude of data points. However, our interest is solely in the Ethereum price for the time being.\n\n## Interfacing with the Contract\n\nThe process of interfacing with this contract (and subsequently getting the Ethereum price) requires us to know two essentials: the contract's address and its Application Binary Interface (ABI). The address is easy to access via the Chainlink documentation, specifically under the 'Price Feed Contracts' section.\n\nAs noted in Chainlink's contract addresses for Ethereum (ETH), we only need to obtain the Ethereum to USD price feed (ETH/USD!). You can access it [here](https://docs.chain.link/data-feeds/price-feeds/addresses).\n\nNext, we tackle the ABI.\n\nThe simplest way to obtain the ABI is by importing, compiling, and deploying the entire contract — a somewhat cumbersome method for our current task, especially considering that we don't need to comprehend the whole contract. We only need a key: what methods (functions) can be called on this contract, their inputs, whether they're payable or view functions, and other similar details.\n\nAn alternate approach relies on the concept of `Interface`.\n\n## Solidity Interface: A Mode of Interaction\n\nIn Solidity, an interface essentially is a declaration of methods without implemented logic — merely a list of possible interactions with a contract. The interface allows us to call these functions on the contract without needing the contract code. If the contract is deployed, the logic is also automatically included with it.\n\nChainlink's GitHub repository provides a detailed rundown of different contracts, and our focus is on the Aggregator V3 Interface. You can review it [here](https://github.com/smartcontractkit/chainlink/blob/develop/contracts/src/v0.6/interfaces/AggregatorV3Interface.sol). This interface is what we need to interact with the contract for our task. It contains the `getVersion()` function, among others, key for our usage.\n\nBy copying the interface and employing Remix, Solidity's online compiler, we can test the `getVersion()` function. Testing on testnets can be time-consuming; hence, it is best to defer full deployment until the end.\n\n```js\n    // Copy the Aggregator V3 Interface from Chainlink's GitHub\n    AggregatorV3Interface interface = AggregatorV3Interface(0x5f4eC3Df9cbd43714FE2740f5E3616155c5b8419);\n    // Create a function to call the getVersion() function in the interface\n    function getVersion() public view returns (uint256) {\n        return interface.version();\n    }\n```\n\nThese code snippets allow us to interact with the Chainlink Price Feed contract and retrieve the current version.\n\nIt's beneficial to remember that in the dynamic field of blockchain and Ethereum, learning is an ongoing cycle. Patience, persistence, and practice are your allies in harnessing the power of Ethereum and Solidity.\n\nJoin us in exploring this exciting technology, and together, let's keep coding!\n\n<img src=\"/solidity/remix/lesson-4/interfaceslesson/interfaces1.png\" style=\"width: 100%; height: auto;\">\n",
          "updates": []
        },
        {
          "lessonId": "4a672ede-7ebe-4c9f-a9b6-50c914249926",
          "number": 8,
          "title": "Use AI to help pt.2",
          "slug": "ai-help-development-part-2",
          "folderName": "8-ai-help-iii",
          "description": "A lesson on using AI models like ChatGPT for understanding complex programming concepts in Solidity, focusing on the function of returning values without logic defined in interfaces. It explores the interaction between functions, contracts, and addresses using AI insights.",
          "duration": 3,
          "videoUrl": "rMVou5VIkm0",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/8-ai-help-iii/+page.md",
          "markdownContent": "---\ntitle: AI Help III\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\nIn our quest for mastering the field of programming, questions and confusions are inevitable stepping stones. From deciphering the unintended consequences of a code block to understanding the intricate mechanisms behind built-in functions, every step in this journey is an opportunity to learn something new. Today, we'll discuss a common confusion that many developers stumble upon: *How does a Solidity function return a value when no logic is defined within it?*\n\nWe'll simplify this problem by providing a context of the Aggregator v3 Interface and explore the interaction between the function, contract, and the address associated with it. This lesson signifies an interactive approach where we speculate, ask questions, and validate our understanding of the topic with the help of AI model Chat GPT. So, let's dive in!\n\n## The Conundrum of the 'Get Version' Function\n\nThe journey begins with an intriguing question related to the Solidity function from the Aggregator v3 Interface.\n\nHere's the question that sets the ball rolling:\n\n\n<img src=\"/solidity/remix/lesson-4/aihelp/ai1.png\" style=\"width: 100%; height: auto;\">\n\n\nTo form a clearer picture, let's look at the code snippet in question:\n\n```js\nfunction getVersion() external view returns (string memory);\n```\n\nOne of the common challenges new developers face is understanding the underlying mechanism of this 'get version' function. How is it able to return a value when there isn't any code defined in the Aggregator v3 Interface? Moreover, what makes it work when we insert an address?\n\nThis is where the incredible AI model Chat GBT comes into play to help unravel the mystery.\n\n## Insights from AI\n\nIn response to the confusion at hand, our AI companion provided an enlightening explanation. According to Chat GBT v3.5,\n\n<img src=\"/solidity/remix/lesson-4/aihelp/ai2.png\" style=\"width: 100%; height: auto;\">\n\n\nThis confirms our suspicion.\n\n<img src=\"/solidity/remix/lesson-4/aihelp/ai4.png\" style=\"width: 100%; height: auto;\">\n\n\nThe `version` function exists within the contract that incorporates this interface. By wrappering the address with Aggregator v3 Interface, we're instructing our Solidity compiler that at this address lies the 'version' function or all the functions encompassed within the Aggregator v3 Interface. If this address lacks the 'version' function, the code would break.\n\n## Further Clarification: What Happens If The Function Doesn't Exist?\n\nGiven the proactive nature of our AI companion, it is responsible and recommended to ensure accurate responses. So, it raises the question: *What would happen if that contract address didn't have that function?*\n\nAs explained by our AI:\n\n<img src=\"/solidity/remix/lesson-4/aihelp/ai3.png\" style=\"width: 100%; height: auto;\">\n\nWhat this entails is that despite not leading to a compilation error, the transaction would consequently revert if the contract address lacks a 'version' function.\n\n## Cross-Verifying with Discussions Forum\n\nAccurate understanding is of paramount importance, and therefore, double-checking is a good practice. In such a scenario, the next step would be to validate this understanding on a discussions forum.\n\nIn conclusion, this lesson elucidates the inner workings of the 'get version' function and the Aggregator v3 Interface, unravelling the hidden interactions and dependencies with the help of AI. By constantly questioning and confirming our understanding of each step, we can ensure we are on the path to mastering blockchain programming.\n\nKeep learning and we'll see you on the next lesson. Happy coding!\n\n",
          "updates": []
        },
        {
          "lessonId": "007993d3-d26f-4bba-9f1b-86ae1ac98cf4",
          "number": 9,
          "title": "Importing libaries from NPM and Github",
          "slug": "import-libraries-smart-contracts-from-npm-github",
          "folderName": "9-importing-from-npm-github",
          "description": "This chapter explores how to import libraries and interfaces directly from GitHub or NPM in Ethereum contract development. It covers the benefits of direct imports for managing interfaces, using the Chainlink AggregatorV3Interface as an example.",
          "duration": 3,
          "videoUrl": "gOQ6Ylk0Tf0",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/9-importing-from-npm-github/+page.md",
          "markdownContent": "---\ntitle: Importing from NPM & GitHub\n---\n\n*Follow along this chapter with the video bellow*\n\n*Follow along this chapter with the video bellow*\n\n\nIn Ethereum contract development, we frequently need to interface with other smart contracts. This usually means importing and dealing with potentially complex and numerous interfaces which can make our contracts untidy and difficult to manage. Is there a better way to do this? Let's explore how to streamline this process in Ethereum's programming environment, the Remix IDE, using Chainlink contracts as an example.\n\n\n### Understanding Interfaces\n\nThe purpose of an interface is to specify the contract's functions and addresses that we want to use or interact with. However, managing many interfaces within our contracts can clutter our files and make working with them cumbersome.\n\nConsider using the SmartContract interface as an example:\n\n```js\ninterface SmartContract {\n    function someFunction() external view returns(uint, uint);\n}\n```\n\nIn the case where we are working with a contract that isn't in our project's local directories such as SimpleStorage, we've learnt that we can easily import the contract by stating `import \"./SimpleStorage.sol\"` at the top of our contract file.\n\nBut what if the contract you want to work with isn't locally stored in your project? Can we still import it as we did with SimpleStorage?\n\n### Direct Imports from GitHub\n\nThe good news is, contracts hosted on GitHub can be directly imported into your project. To demonstrate, let's take the example of the `AggregatorV3Interface` contract from Chainlink. We didn't create this interface, and it isn't stored locally in our project's directory.\n\nOne approach could be to copy the entire code, create a new file within our project (for example, `AggregatorV3Interface.sol`), paste the copied code, and then import this file into our contract. Effective, but tedious.\n\n```js\nimport \"./AggregatorV3Interface.sol\";\n```\n\nIs there a more efficient way? Let's return to the [Chainlink documentation](https://docs.chain.link/docs/using-chainlink-reference-contracts). As we scroll down, we notice an `import` statement.\n\n```js\nimport \"@chainlink/contracts/src/v0.8/interfaces/AggregatorV3Interface.sol\";\n```\n\nThis import command contains the path that corresponds to the `AggregatorV3Interface.sol` GitHub repository. This means we can directly import the contract from GitHub or NPM, ridding us of the need to manually copy and paste.\n\n### Understanding the Import Method\n\nTo further comprehend what this import does, let's dissect it. `@chainlink/contracts` is a package existing on NPM (Node Package Manager), it consists of different versions of combinations of code that we can download and use. This package is directly derived from Chainlink's GitHub repository. The rest of the path tells Remix specifically which file we want to import.\n\nRemix is intelligent enough to interpret this `import`, observing `@chainlink/contracts` as referring to the NPM package. Consequently, Remix downloads all the necessary code from NPM, which is essentially sourced directly from GitHub.\n\nAdding the `import` statement to our contract is, therefore, equal to copy-pasting the entire interface at the top of our contract. Simplifying our effort and reducing clutter.\n\n```js\n    pragma solidity 0.8.18;\n    import \"@chainlink/contracts/src/v0.8/interfaces/AggregatorV3Interface.sol\";\n    contract MyContract {}\n```\n\nAfter adding the `import` statement, we can successfully compile the `AggregatorV3Interface` contract. Badaboom, badaboom.\n\n<img src=\"/solidity/remix/lesson-4/imports/imports1.png\" style=\"width: 100%; height: auto;\">\n\nIndeed, this method ensures we are following efficient development practices and keeps our code clean and manageable.\n\n## Conclusion\n\nIt's crucial to regularly wise up to new and efficient tricks to keep our code clean and easier to manage. Importing contracts directly from NPM or GitHub is one such smart method! Happy coding.",
          "updates": []
        },
        {
          "lessonId": "1e873454-026c-446a-89d5-dc5a6267d01b",
          "number": 10,
          "title": "Getting real world price data from Chainlink",
          "slug": "getting-prices-from-chainlink",
          "folderName": "10-getting-prices-from-chainlink",
          "description": "The lesson focuses on extracting real-world pricing information using the Aggregator V3 interface from Chainlink. It covers creating contract instances, summoning 'latestRoundData', dealing with decimals in Solidity, and typecasting for price and value compatibility.",
          "duration": 4,
          "videoUrl": "fQVIYzZxv1c",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/10-getting-prices-from-chainlink/+page.md",
          "markdownContent": "---\ntitle: Getting Prices from Chainlink\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n\nWhen it comes to blockchain development and interaction with smart contracts, JSON RPC interfaces and Application Binary Interfaces (ABIs) play an essential role. One such interface is the Aggregator V3, which provides a minimalistic ABI for developers to interact with their contracts. Today, we'll explore how to extract requested pricing information using Solidity.\n\n## Creating a New Contract Instance\n\nThe `AggregatorV3` interface encloses the prerequisites like the `latestRoundData` function which is commodious for getting the latest price.\n\nTo proceed, we'll initiate declaring the `AggregatorV3` interface and creating a new variable named `priceFeed`. This variable will denote a contract instance at a specific address, which is legit for Sapolia network:\n\n```js\n    AggregatorV3Interface priceFeed = AggregatorV3Interface(/*address to your contract*/)\n\n```\n\nThe object `priceFeed` now allows us to summon the `latestRoundData` function on it.\n\n## Summoning latestRoundData\n\nIn the official documentation on GitHub, `latestRoundData` is described to return multiple results, including the last round ID, price, the time the price started on-chain, timestamp, and the round ID of the last round when the price was answered. However, we'd only be concerned with the price for now, so we'll exclude other return types:\n\n```js\nfunction getLatestPrice() public view returns (int) {\n    (,int price,,,) = priceFeed.latestRoundData();\n    return price;\n}\n```\n\nHere, we leave the commas to placeholders for exit variables, which we don't need.\n\nOur new function `getLatestPrice()` now extracts the latest price from the `latestRoundData()` function. This function returns the value of Ether in USD.\n\nGenerally, the returned price exists as an integer since Solidity's incompatibility with decimals. This brings us to the tricky part of compatibility between `price` (a `uint256`) and `msg.value` which is an `int256`.\n\n## Dealing with Decimals\n\nTypically, `msg.value` has 18 decimal places. This means that the `price` returned from our `latestRoundData` function isn't compatible with `msg.value`. To make them match, we simply multiply `price` by `1e10`:\n\n```js\nreturn price * 1e10;\n```\n\nThere's been a little confusion here. `Price` is an `int256` and `msg.value` is a `uint256`. At this juncture, we will perform an operation known as 'typecasting' to convert the 'price' from `int256` to `uint256`.\n\n## Typecasting in Solidity\n\nTypecasting is an operation you can use to convert one datatype into another. It's important to note that not all datatypes can be converted into one another, but for our situation, we can boldly convert an `int` to a `uint`.\n\n```js\nreturn uint(price) * 1e10;\n```\n\nSo, we've managed to get the same number of decimals for both the variables, and also ensured that they're now of the same type; in other words, made them compatible for mathematical operations.\n\nBeing a function that reads storage without modifying any state, our function can be made a `view` function and it should return a `uint256`:\n\n```js\nfunction getLatestPrice() public view returns (uint) {\n    (,int price,,,) = priceFeed.latestRoundData();\n    return uint(price) * 1e10;\n    }\n```\n\nBy compiling our contract now, we refactor all earlier warnings and errors.\n\nWorking with Solidity can be arduous, especially since there aren't any decimal places, but practice makes perfect!\n\n<img src=\"/solidity/remix/lesson-4/prices/prices1.png\" style=\"width: 100%; height: auto;\">\n\n\nAs long as we keep in mind the limitations of Solidity and Ethereum, we can take advantage of what they offer to create compelling smart contracts and applications. And with that, you've now learned how to make sense of `AggregatorV3Interface` to extract useful contract data. We are certain that armed with this knowledge, you can advance your smart contract development skills to greater heights.\n\nBut we are just getting started. In the next lesson, we'll explore more Solidity Math, so stay tuned!",
          "updates": []
        },
        {
          "lessonId": "e82b4210-de20-4557-8924-1a21a2ded429",
          "number": 11,
          "title": "Solidity math",
          "slug": "solidity-math",
          "folderName": "11-more-solidity-math",
          "description": "This lesson provides insights into converting Ethereum value to USD using Solidity. It covers the implementation of 'getPrice' and 'getConversionRate' functions, understanding decimal places, value validation, and deployment on a testnet.",
          "duration": 7,
          "videoUrl": "UEfpFLtlzTk",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/11-more-solidity-math/+page.md",
          "markdownContent": "---\ntitle: More Solidity Math\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n\nIn this lesson, we're going to walk through the conversion of the Ethereum value to USD using Solidity. The purpose of this tutorial is to understand how Ethereum contract operations work, using the `getPrice` and `getConversionRate` functions.\n\n## Settling Down with the `getPrice` Function\n\nThe `getPrice` function returns the value of Ethereum in terms of USD. This value is returned as a `uint256`. Armed with this handy function, we can convert message value into dollar terms.\n\n## Breaking Down the `getConversionRate` Function\n\nThe `getConversionRate` function takes a `uint256` Ethereum (ETH) amount as input. The core objective of this function is to convert ETH into USD dollar value.\n\n\n### Understanding the Importance of Decimal Places\n\nIn Solidity, due to the lack of decimal numbers (only whole numbers work), we should always multiply before dividing. Coupled with the fact that both values have 18 decimal places, we have to divide the final calculated product by `1E18`.\n\n<img src=\"/solidity/remix/lesson-4/math/math1.png\" style=\"width: 100%; height: auto;\">\n\nFor instance, let's put $2000 as ETH's value in dollar terms. The calculation would look like this:\n\n1. `ETH_Price`= $2000 (with 18 decimal places)\n2. Multiply ETH\\_Price by 1 ETH\n3. Now we'll have an extra 36 decimal places since 1 ETH also has 18 decimal places\n4. Divide the result with `1E18`\n\nThis function helps to handle the bulk of the math conversions for us. It takes our ETH amount and returns its equivalent in USD.\n\n## Value Validation\n\nNow, if we want to magnify the application of this function, let's assume we want to check if our users are sending at least $5.\n\n```js   \n    getConversionRate(msg.value) >= Minimum_USD\n    // In other terms:\n    require(PriceConverter.getConversionRate(msg.value) >= MINIMUM_USD, \"You need to spend more ETH!\");\n```\n\nThe value returned by `getConversionRate` function are calculated in 18 decimal places, so our $5 threshold would be `5E18` or `5*1E18`.\n\n## Deployment to the Testnet\n\nLet's say we deploy this to a testnet. After a long pause, we get our deployed contract. Using the `getPrice` function, we would get the current value of Ethereum.\n\nNow, if we try to add $5 to the fund, we'll probably get an error saying,\n\n```js\nGas estimation failed. Error execution reverted, didn't send enough ETH.\n```\n<img src=\"/solidity/remix/lesson-4/math/math2.png\" style=\"width: 100%; height: auto;\">\n\n\nThis error is triggered when the amount in ETH is less than our $5 benchmark.\n\n\nBut if we attempt to fund with at least $5 worth of ETH,\n\nOur transaction gets through probably and shows no sign of the previous gas error.\n\n## Wrapping Up\n\nSolidity is a powerful language for writing smart contracts, and the ability to convert Ethereum into USD is a fundamental task.\n\nAs it stands, the `getConversionRate` function is working effectively in routing transactions worth less than $5 and ratifying ones equivalent to or more than $5 worth of ETH.\n\nIn our future lessons, the focus will be on withdrawal functions and contract interactions using Solidity. But for now, it's time to move forward!\n\n<img src=\"/solidity/remix/lesson-4/math/math3.png\" style=\"width: 100%; height: auto;\">\n\n\nHappy Coding!\n",
          "updates": []
        },
        {
          "lessonId": "eb82b3ce-5af7-4f79-9fe5-1004776159e0",
          "number": 12,
          "title": "Msg sender explained",
          "slug": "solidity-msg-sender",
          "folderName": "12-msg-sender",
          "description": "The lesson introduces the use of Solidity's global variables, arrays, and mappings to track users sending money to a contract. It covers creating a mechanism to record addresses and amounts sent by users using 'msg.sender' and mappings.",
          "duration": 2,
          "videoUrl": "sSlMakVGEHg",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/12-msg-sender/+page.md",
          "markdownContent": "---\ntitle: Message Sender (msg.sender)\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n\nAs you continue to dive deeper into the world of Solidity, you may find yourself wondering: \"How can I keep track of users sending money within a contract?\" and \"How can I easily look up how much each user has spent?\" In today's lesson, we'll walk through how to achieve this using Solidity's global variables, arrays, and mappings.\n\n## What are we doing next?\n\nThe first task at hand is to create a mechanism within the contract that keeps track of the users (addresses) who send money to the contract. For this purpose, we will create an array of addresses. The array will constantly be updated depending on who sends us money.\n\n```js\naddress[] public funders;\n```\n\nNote that the array is `public`. Meaning, it is accessible to anyone who interacts with the contract.\n\nWe will then update this array whenever money is incoming. Let's indicate this action by adding:\n\n```js\nfunders.push(msg.sender);\n```\n\nThe `msg.sender` global variable is a key feature in Solidity. It refers to the address that initiates a transaction (i.e., the sender of the transaction). In essence, we're saying \"whenever someone sends us money, add their address to the `funders` array\".\n\n<img src=\"/solidity/remix/lesson-4/sender/sender1.png\" style=\"width: 100%; height: auto;\">\n\n\n## Mapping addresses to their funds\n\nLet's take this a step further and also associate the address of each funder to the amount sent using mappings.\n\nThis mapping will make it easier to look up the total amount each user has sent quick and easy. Let’s denote a mapping within Solidity as:\n\n```js\nmapping (address => uint256) public addressToAmountFunded;\n```\n\nIn Solidity, we now also have the capability to name the types in your mapping which adds clarity to our code. Here's an example:\n\n```js\nmapping (address => uint256 funderMappedToAmountFunded) public addressToAmountFunded;\n```\n\nIn this line of code, the variable name `addressToAmountFunded` is highly explicit and self-explanatory. It adds what is commonly referred to as \"syntactic sugar,\" making it easier to read what the mapping is about.\n\nFinally, let’s complete this mapping by adding the amount the user sends to their total funds.\n\n```js\naddressToAmountFunded[msg.sender] += msg.value;\n```\n\n## What Have We Achieved?\n\n<img src=\"/solidity/remix/lesson-4/sender/sender2.png\" style=\"width: 100%; height: auto;\">\n\nWe now have a way to keep track of funders sending money to our contract and to easily determine how much they've sent in total. This knowledge will aid in designing more complex contracts in the future, as well as creating a more intuitive and user-friendly blockchain experience.\n\nBe sure to join us for our next tutorial to further your understanding of Solidity and blockchain!\n\n",
          "updates": []
        },
        {
          "lessonId": "abed0d0d-602d-46bc-a9ad-f1df9e6c42f6",
          "number": 13,
          "title": "Quick section recap",
          "slug": "quick-recap-fund-me",
          "folderName": "13-quick-recap-ii",
          "description": "A comprehensive refresher on key concepts in Advanced Solidity, covering contract addresses and ABIs, interfacing with contracts, using Chainlink Price Feeds, handling decimals and global units in Solidity, and the importance of these elements in smart contract development.",
          "duration": 4,
          "videoUrl": "NLTKk9k8eTE",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/13-quick-recap-ii/+page.md",
          "markdownContent": "---\ntitle: Quick Recap II\n---\n\n*Follow along this chapter with the video bellow*\n\n\n\n# Advanced Solidity: A Comprehensive Refresher\n\nHey you, welcome back! Having ventured into the depths of Advanced Solidity, We are sure you have been inundated with loads of information, from compiler instructions to price feeds. Let's re-trace our learning path and perform a detailed recap of what we've tackled so far. Remember, every move in the arduous world of Solidity programming counts.\n\n## Starting With a Contract: Address and Abi\n\nThe bedrock of any smart contract is the `address` and `Abi` (Application Binary Interface.) Remember, to interact with any contract, you need these two elements ideally. In the most straightforward terms, an `address` is similar to a house number that helps identify the specific contract in the blockchain universe. The `Abi`, on the other hand, is a manual revealing how the contract can be used.\n\n```js\n    // In JavaScript\n    let contractAddress = \"0x....\";\n    let contractAbi = [...];\n```\n\n<img src=\"/solidity/remix/lesson-4/recap/recap1.png\" style=\"width: 100%; height: auto;\">\n\n## Interfacing with the Contract\n\nTo get the Abi easily and subsequently interact with another contract, you need to compile an interface. This is a critical step, akin to building a radio set that helps you tune into the contract's frequency. Combining the contract `address` with the interface essentially streamlines calling on the contract's functions.\n\n\n## Linking Up: Using Chainlink Price Feeds\n\nIn our sturdy armor of Solidity programming, [Chainlink Price Feeds](https://docs.chain.link/docs/using-chainlink-reference-contracts/) are the trusty sword. They provide an efficient way to access real-world data, particularly **pricing data**, and inject it into our smart contracts – a process that's as seamless as sipping coffee while going through the morning news!\n\n<img src=\"/solidity/remix/lesson-4/recap/recap2.png\" style=\"width: 100%; height: auto;\">\n\n\n## Making Math Work in the EVM\n\nWhen it comes to working with mathematics in Solidity and the Ethereum Virtual Machine (EVM) in general, decimals are a no-go zone - they just don't play well in here. So, make sure you're always using the correct unit conversion when dealing with your contracts.\n\n\n## Getting to Grips with Global Units in Solidity\n\nDominated by two players: `msg.value` and `msg.sender`, globally available units in Solidity tell a lot about the transaction at hand. `msg.sender` refers to the account that started the current function call, while `msg.value` represents the number of wei sent with that particular function call.\n\n```js\n    function updateValue() public payable {\n        require(msg.value >= 1 ether, \"Not enough Ether provided.\");\n    }\n```\n\n<img src=\"/solidity/remix/lesson-4/recap/recap3.png\" style=\"width: 100%; height: auto;\">\n\nTo wrap it up, I believe you now have a thorough understanding - if not a complete masterclass of what we've learned so far in Advanced Solidity. As we continue our journey, always remember that understanding and mastering the basics create a solid foundation for the complex elements to come as we further demystify Solidity!",
          "updates": []
        },
        {
          "lessonId": "e5043367-e48c-44b4-9a50-6016c9057d19",
          "number": 14,
          "title": "Creating your own libraries",
          "slug": "create-solidity-library",
          "folderName": "14-libraries",
          "description": "This lesson covers the creation and use of Solidity Libraries to streamline code and avoid redundancy. It demonstrates how to create a library, transfer functions to it, and utilize the library in contracts for efficient code management and functionality enhancement.",
          "duration": 5,
          "videoUrl": "HLqimKeA60s",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/14-libraries/+page.md",
          "markdownContent": "---\ntitle: Libraries\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nEver wanted to streamline your code by getting rid of some repeated functions or routine workflows? Is it too tiresome and annoying to rewrite code snippets to maintain pricing information? Well, then, you're in the right place! In this blog post, we will discuss an efficient way to solve these problems using Solidity Libraries.\n\nSolidity Libraries are instrumental for reusing codes and adding functionality to different Solidity types. So, let's dive straight into some code and see how we can significantly refine our workflow.\n\n## What is a Solidity Library?\n\nSolidity Libraries are similar to contracts but do not allow the declaration of any state variables and you can't send ether to them. An important point to note is that a library gets embedded into the contract if all library functions are internal. And in case any library functions are not internal, the library must be deployed and then linked before the contract is deployed.\n\nIn this post, we will create a library that will allow us to work with our `getPrice`, `getConversionRate` and `getVersion` functions much more efficiently.\n\n## Creating a New Library\n\nBegin by creating a new file called `PriceConverter.sol`. This is going to accommodate the library we desire to create and we'll call it `PriceConverter`. We kickstart by providing the SPDX license identifier and a specified compiler pragma, in our case `0.8.18`. Be careful to replace the `contract` keyword with `library`.\n\n```js\n    // SPDX-License-Identifier: MIT\n    pragma solidity ^0.8.18;\n    library PriceConverter {}\n```\n\nRemember, library in Solidity won't contain any state variables and must mark all the functions as `internal`.\n\nLet's move our `getPrice`, `getConversionRate` and `getVersion` functions from the `FundMe.sol` contract to our new library. Follow the steps below:\n\n- Go to `FundMe.sol`, and copy `getPrice`, `getConversionRate` and `getVersion` functions.\n- Paste them in the `PriceConverter.sol`.\n- Import the `AggregatorV3Interface` into `PriceConverter.sol`.\n\nNow, mark all these functions as internal, and you've done setting up your library!\n\n```js\nlibrary PriceConverter {\n    // SPDX-License-Identifier: MIT\n    pragma solidity ^0.8.18;\n\n    import {AggregatorV3Interface} from \"@chainlink/contracts/src/v0.8/interfaces/AggregatorV3Interface.sol\";\n\n    function getPrice() internal view returns (uint256) {\n        AggregatorV3Interface priceFeed = AggregatorV3Interface(0x694AA1769357215DE4FAC081bf1f309aDC325306);\n        (, int256 answer, , , ) = priceFeed.latestRoundData();\n        return uint256(answer * 10000000000);\n    }\n\n\n    function getConversionRate(\n        uint256 ethAmount\n    ) internal view returns (uint256) {\n        uint256 ethPrice = getPrice();\n        uint256 ethAmountInUsd = (ethPrice * ethAmount) / 1000000000000000000;\n        return ethAmountInUsd;\n    }\n}\n```\n\n## Make your library functionalities accessible in contract\n\nTo use the library functions in your contract, import the library in your contract and attach it to the desired type. Here, we attach the library to `uint256` as follows:\n\n```javascript\nimport \"./PriceConverter.sol\";\nusing PriceConverter for uint256;\n```\n\nNow, these library functions act as if they belonged to the `uint256` type. Even though you're not passing any variables in `getPrice()` and `getVersion()` functions, the value will still pass on and get ignored.\n\nCalling the `getConversionRate()` function now looks like this:\n\n```javascript\nuint256 conversionRate = msg.value.getConversionRate();\n```\n\nHere, `msg.value`, which is a `uint256` type, has been enhanced to include the `getConversionRate()` function. The `msg.value` gets passed as the first argument to the function.\n\nFor more than one argument, the additional arguments will be passed after the first argument as demonstrated below:\n\n```javascript\nuint256 result = msg.value.getConversionRate(123);\n```\n\nHere `123` will be passed as the second `uint256` argument in the function.\n\n## Final Thoughts\n\nCongrats on creating your very first Solidity Library! Now, you can handle even complicated pricing details effortlessly! This process saves time and reduces the redundancy of code reuse across the project. It also helps to provide more clarity to the code by encapsulating some functionalities away from the smart contract.\n\nIn conclusion, Solidity libraries are a great way to enhance your contracts with additional functionalities, thereby contributing to more robust and cleanly written smart contracts. Happy coding!\n",
          "updates": []
        },
        {
          "lessonId": "b9897219-bdc3-4e41-b7fd-0d02708bafaa",
          "number": 15,
          "title": "Using Safemath",
          "slug": "safemath",
          "folderName": "15-safemath",
          "description": "An introduction to the SafeMath library in Solidity, explaining its significance before Solidity 0.8 and the reasons for its reduced usage post Solidity 0.8. The lesson covers integer overflow issues and the implementation of automatic checks in newer Solidity versions.",
          "duration": 6,
          "videoUrl": "X6o3wmzBvy4",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/15-safemath/+page.md",
          "markdownContent": "---\ntitle: SafeMath\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\n## Introduction to SafeMath Library\n\nThe world of Solidity is rich with various libraries designed to make your smart contract development journey smoother. However, there's this one library that has gained notoriety in the Solidity community – `SafeMath.sol`. Whether you are a seasoned Solidity engineer or just starting, you'd likely encounter SafeMath in your interaction with the Ethereum world. But, as with most software components, libraries evolve with time. Let's explore what `SafeMath.sol` used to be, and why its usage has decreased.\n\n<img src=\"/solidity/remix/lesson-4/safemath/safemath1.png\" style=\"width: 100%; height: auto;\">\n\n## Understanding SafeMath Library\n\n`SafeMath.sol` was a staple in Solidity contracts before version 0.8. However, its usage has dropped significantly. So, if it was once popular, why did developers stop using it? What exactly changed? Let's examine what `SafeMath.sol` was designed to manage.\n\nFirst, let's create a new file called `SafeMathTester.sol` and explore this library in action.\n\n```javascript\n// SafeMathTester.sol\npragma solidity ^0.6.0;\ncontract SafeMathTester {\n    uint8 public bigNumber = 255;\n    function add() public {\n        bigNumber = bigNumber + 1;\n       }\n}\n```\n\nHere, we use the version `0.6.0` of Solidity. The `SafeMathTester` contract has a `uint8` data type `bigNumber` with the maximum capacity of `255`.\n\nAfter deploying this contract to a JavaScript Virtual Machine (JVM) or even a test network, invoking the `bigNumber` function will return `255` (its initial value), as anticipated. Interestingly, invoking the `add` function (which adds `1` to `bigNumber`) returns `0` when queried again, not `256` as one might expect. What's going on?\n\nBefore the 0.8 version of Solidity, signed and unsigned integers were unchecked, meaning that if your calculations exceeded the numerical limit of the variable type, it would wrap around to the lower limit. This pattern is known as integer overflow and it’s exactly what SafeMath library was designed to prevent.\n\n## Addressing Integer Overflow with SafeMath.sol\n\nSafeMath.sol provided a mechanism to halt transactions upon reaching the maximum limit of a `uint256` or `int256` data type. It was a typical security measure and a convention across contracts to avoid erroneous calculations and potential exploits.\n\n```javascript\nfunction add(uint a, uint b) public pure returns (uint) {\n    uint c = a + b;\n    require(c >= a, \"SafeMath: addition overflow\");\n    return c;\n}\n```\n\nIn the above example, through `require` statements, `SafeMath.sol` ensures the result of the addition operation always equals or exceeds the first operand. This approach effectively prevents an overflow.\n\nHowever, the SafeMath library is less common in newer versions of Solidity. Why?\n\n## Changes in Solidity 0.8 and the Decline of SafeMath.sol\n\nWith the introduction of Solidity version 0.8, automatic checks for overflows and underflows were implemented, making SafeMath less essential.\n\n```javascript\n// SafeMathTester.sol\npragma solidity ^0.8.0;\ncontract SafeMathTester {\n    uint8 public bigNumber = 255;\n    function add() public {\n        bigNumber = bigNumber + 1;\n    }\n}\n```\n\nIn the `SafeMathTester.sol` contract, if we deploy this to a JavaScript VM using Solidity `0.8.0`, invoking the `add` function will cause a transaction to fail, whereas, in older versions, it would have reset back to zero. The introduction of this automatic check in Solidity `0.8.0` effectively rendered the `SafeMath.sol` library redundant for overflow and underflow checking.\n\nHowever, for scenarios where mathematical operations are known not to exceed a variable's limit, Solidity introduced the `unchecked` construct to make code more gas-efficient. Wrapping the addition operation with `unchecked` will bypass overflow and underflow checks and revert back to the old behavior, where exceeding the limit wraps the value to zero.\n\n```javascript\nuint8 public bigNumber = 255;\n    function add() public {\n        unchecked {bigNumber = bigNumber + 1;\n    }\n}\n```\n\nIt's important to note that unchecked blocks should be used with caution as they reintroduce the chance for overflows and underflows to occur.\n\n## Conclusion\n\nThe evolution of Solidity and `SafeMath.sol` illustrates the continuous advancements in Smart Contract development on Ethereum. While `SafeMath.sol` has become less essential with recent updates, it is still a critical piece of Ethereum's history, and understanding it gives us a broader perspective of Solidity's progress. In our daily work, we can now focus our efforts on using the latest features like the Price Converter library in our newly created FundMe contract.\n\nBy constantly learning and adapting to new changes, we can make the most of the versatile, yet intricate world of Solidity development.\nKeep learning and we will see you on the next chapter!\n",
          "updates": []
        },
        {
          "lessonId": "ac452aa0-0d21-468f-b1b6-aafa7cd7a811",
          "number": 16,
          "title": "Solidity for Loop",
          "slug": "solidity-for-loop",
          "folderName": "16-for-loop",
          "description": "This lesson teaches the concept of for loops in Solidity, demonstrating how they can be used to access and manipulate arrays. It focuses on practical applications in a smart contract, particularly for iterating over arrays and resetting mappings.",
          "duration": 5,
          "videoUrl": "HSCJFwoi6ew",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/16-for-loop/+page.md",
          "markdownContent": "---\ntitle: For Loop\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nHey there, awesome learners! In the previous lesson, we've managed to get the basics of the math for our `FundMe` contract. Up to now, people can send us money and we keep track of them - a crucial foundation for our contract. Now, we are ready to move to the next step of our project: withdrawing the accumulated funds. After withdrawing, we'll also reset all the mappings back to zero. We'll accomplish this using a concept known as a for loop.\n\n## Understanding for Loops\n\nIn many programming languages, you'll encounter the concept of a for loop. Essentially, a for loop enables us to loop through a list or execute a block of code a designated number of times.\n\nFor instance, consider this list:\n\n```js\nList_Example = [1, 2, 3, 4];\n```\n\nThe elements of the list are the numbers 1 through 4, with indices ranging from 0 through 3; i.e., 1 is at the 0th index, 2 is at the first index, and so forth.\n\nTo access all the elements in this list, we would loop from 0 to 3. You can identify elements via their indexes.\n\nThis looping process uses the `for` keyword. A typical `for` loop structure in programming languages can initialize at some starting index, iterate until an end index, and increment by certain steps. For instance, starting at index 0, ending at index 10, and incrementing by 1 each time would get you:\n\n```\n0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10\n```\n\nHowever, starting at the 3rd index, ending at the 12th index, and incrementing by 2 each time would get you:\n\n```\n3, 5, 7, 9, 11\n```\n\nIn this process, we can capture the essence of the `for` loop: repeat a set of actions for a determined sequence of values.\n\n## Using for Loops in Solidity: Fund Me Contract\n\nLet us implement this concept in our project.\n\n```js\nuint256 funderIndex;\nfor(funderIndex = 0; funderIndex < funders.length; funderIndex++) {\n    address funder = funders[funderIndex];\n    addressToAmountFunded[funder] = 0;\n    }\n```\n\nLet's dissect this block of code. The loop begins at the 0th index and traverses through the `funders` array until it reaches the final element. With each iteration, it accesses the `funderAddress` at the current index and then resets the corresponding funding amount in the `addressToAmountFunded` mapping to zero, effectively clearing the record of the associated donation.\n\n<img src=\"/solidity/remix/lesson-4/forloop/forloop1.png\" style=\"width: 100%; height: auto;\">\n\nAdditionally, we have used two shortcuts in our code.\n\n1. `funderIndex++`: Instead of writing `funderIndex = funderIndex + 1`, we can use the `++` operator to simplify the increment by one within the loop.\n2. `+=`: Another handy shorthand is `+=`, used when you want to add something to an existing value. Instead of writing `x = x + y`, you can write `x += y`.\n\nLet's summarize the for loop process in our case. We start from `funderIndex` 0, get the address of the funder at the 0th position in our funder array, and set the amount they funded to zero in our mapping. After that, we increment `funderIndex` by 1 and check whether it is still less than the total number of funders. We then get the address of the funder at the first position, again set their funding amount to zero, and continue this process until `funderIndex` equals the total number of funders.\n\nWith our `withdraw` function, we can now access and withdraw the money our contract has raised. Once we've withdrawn the money, we clear all previous records and ready ourselves for new transactions. This gives us a clean slate, symbolising the precise management of funds in our financing smart contract.\n\nThis is just an illustration of how important and useful loops can be in programming and development of smart contracts. Indeed, familiarity with loops is a crucial aspect of becoming a competent developer - they help us write clean, efficient, and repetitive code blocks.\n\nStay tuned for more updates on our developing smart contract!\n",
          "updates": []
        },
        {
          "lessonId": "82088b31-f119-4d15-b2ec-f6fa644e626f",
          "number": 17,
          "title": "Resetting an Array",
          "slug": "solidity-reset-an-array",
          "folderName": "17-resetting-an-array",
          "description": "A guide on effectively resetting arrays in Solidity, particularly within the context of smart contracts. The lesson addresses the importance of resetting arrays for managing and updating contract states, and demonstrates the process using practical examples.",
          "duration": 2,
          "videoUrl": "0KRhBO6JgSM",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/17-resetting-an-array/+page.md",
          "markdownContent": "---\ntitle: Resetting an Array\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nIn the previous lesson on smart contracts in Ethereum, we discussed how to handle value funds and introduced the `mapping` keyword with Ethereum's Solidity. In this stage of our course, our main focus will be on how to reset an array effectively and to withdraw funds appropriately from our smart contract.\n\nNow, you might remember that we have two overdue tasks from our last session:\n\n1. Resetting the array\n2. Withdrawing the funds\n\nLet's get started by tackling these one by one.\n\n## Resetting the Array\n\nWe have previously learned that one can accumulate value in the `msg.value` function with a fund function and then subsequently reset the funders array. For this purpose, we can adopt the same tactic we previously employed with 'mapping'; accessing and resetting each single address at each index.\n\nHowever, there also exists a simpler solution: let's just recreate the whole funders array anew! Here's how you can do that:\n\n```js\nfunders = new address[](0);\n```\n\nThe `new` keyword, you may recall, we used in a different context within our last course - deploying a contract. Its use here, however, is to reset the `funders` array. This equates to initializing a brand-new, blank address array.\n\nI want to take a moment here to remind you that this particular use might initially seem perplexing. Nonetheless, it is crucial not to let it deter your learning progress.\n\n<img src=\"/solidity/remix/lesson-4/arrays/arrays1.png\" style=\"width: 100%; height: auto;\">\n\nNow that we successfully reset the array, our next step would be to handle the fund withdrawal from the contract.\n\n## Withdrawing the Funds\n\nFor this section, I would refer back to a course we had done previously as the content to withdraw funds aligns precisely with this function. If you need a refresher.\n\nRemember, even if we're dealing with a smart contract this round, the concept remains the same, even in a JavaScript runtime environment, like Remix VM.\n\nCode functionality, be it resetting arrays or withdrawing funds, may seem simple on the surface but they carry great weight in the realm of smart contracts. Remember, clarity of function and security of execution is the mantra to follow in our line of work. Remain persistent and keep exploring. Happy coding!\n",
          "updates": []
        },
        {
          "lessonId": "a87b6e64-814d-477e-bd2e-8a40c296ed3d",
          "number": 18,
          "title": "Sending ETH from a contract",
          "slug": "sending-eth-from-a-contract",
          "folderName": "18-sending-eth-from-a-contract",
          "description": "An exploration of three methods for sending Ether from a contract in Solidity: transfer, send, and call. The lesson compares these methods, discussing their syntax, behavior, and appropriate use cases, with a focus on their gas usage and security implications.",
          "duration": 8,
          "videoUrl": "Z_HPzbzZ-k4",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/18-sending-eth-from-a-contract/+page.md",
          "markdownContent": "---\ntitle: Transfer, Send and Call\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nOne important aspect is understanding how to securely and effectively withdraw funds from a smart contract. This tutorial explores three different methods of doing this – `transfer`, `send`, and `call`. We will examine their differences, understand how each one works, and determine when to use each strategy.\n\n## Transfer Function In Ethereum\n\nWe start by discussing the `transfer` function, mostly due to its simplicity and straightforwardness. Here is a basic representation of how to use this function:\n\n```js\npayable(msg.sender).transfer(address(this).balance);\n```\n\nWe utilize `msg.sender` which refers to the address initiating the transaction. The `transfer` function is used to send the specified amount of Ether (or the native cryptocurrency on the current blockchain).\n\nIt is worth noting the necessity of converting the `msg.sender` to a payable address to facilitate the transfer. This is achieved by wrapping the `msg.sender` with the `payable` keyword.\n\nHowever, `transfer` has a significant limitation. It can only use up to 2300 gas and it reverts any transaction that exceeds the gas limit. When your transaction requires more gas, this function fails and reverts the transaction entirely. Additionally, [Solidity by example](https://solidity-by-example.org/sending-ether/) offers an excellent reference point for this discussion.\n\n## Send Function\n\nOur second method is the `send` function. Syntax-wise, it is similar to `transfer`, but it has a slightly different behavior. Here is how you would write it:\n\n```js\nbool success = payable(msg.sender).send(address(this).balance);\nequire(success, \"Send failed\");\n```\n\nSimilar to the `transfer` function, `send` also has a gas limit of 2300. However, instead of completely reverting the transaction, it returns a Boolean value (`true` or `false`) to indicate the success or failure of the transaction. In case of failure, the contract is still intact. It is your responsibility as a developer to ensure that errors are caught, which is the purpose of `require(success, \"Send failed\");`. This line of code enforces that the send operation must be successful.\n\n## Call Function\n\nFinally, the `call` function is the most flexible and powerful of the three. It can be used to call virtually any function in Ethereum without requiring the function's abi (application binary interface). More importantly, it does not have a capped gas limit. It forwards all available gas to the transaction.\n\n```js\n(bool success, ) = payable(msg.sender).call{value: address(this).balance}(\"\");\nrequire(success, \"Call failed\");\n```\n\nTo send funds using the `call` function, we modify our syntax slightly by including squiggly brackets `{'{'}...{'}'}`, where we can add details about the transaction, such as the value being transacted.\n\nThe `call` function also returns two variables: a Boolean for success or failure, and a byte object which stores returned data if any. The code `require(success, \"Call failed\");` ensures that the transaction must succeed, similar to the `send` method.\n\n<img src=\"/solidity/remix/lesson-4/transfer/transfer1.png\" style=\"width: 100%; height: auto;\">\n\nHowever, understanding the difference between these three functions may be challenging initially. Don't worry! Continue experimenting and learning about lower-level functions and the concept of gas. Go back to this tutorial when you have a broader understanding of these topics.\n\nFeel free to refer to [Solidity, by example](http://solidity-by-example.org), which provides a comprehensive comparison among these three functions. To summarize, `transfer` throws errors when transactions fail and is capped at 2300 gas. `send` operates similarly but returns a Boolean value instead of reverting the entire transaction. `call`, on the other hand, forwards any available gas and is therefore not capped, returning a Boolean value similar to `send`.\n\nHopefully, this tutorial makes it clear how to use these three functions to send and transfer Ethereum or other blockchain native currency tokens.\n\nKeep Learning and we will see you in the next chapter!\n",
          "updates": []
        },
        {
          "lessonId": "38e91f6c-1127-4ef3-961c-ed859b75546f",
          "number": 19,
          "title": "Smart contract constructor",
          "slug": "solidity-smart-contract-constructor",
          "folderName": "19-constructor",
          "description": "This lesson focuses on using the constructor function in Solidity for role assignment, particularly for setting a contract owner. It discusses the security implications and demonstrates how to restrict certain functionalities, like fund withdrawal, to the owner.",
          "duration": 4,
          "videoUrl": "GCi3LWYSk_g",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/19-constructor/+page.md",
          "markdownContent": "---\ntitle: Constructor\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\n# Solidity: Bolstering Contract Security\n\nWelcome to another exciting guide on Solidity. In this blog, we will further explore the complex, puzzling, but intriguing world of smart contracts. Our primary focus will be on securing the withdrawal functions in contracts. This effort ensures that only contract owners can withdraw funds, not just any layperson.\n\nTo sweeten the deal, I'll be using the same code we used in the previous video tutorial. Thus those familiar with the old code (or those brave enough to peek at the previous guide) will be at ease. Now let's dive in!\n\n## Addressing the Security Gap\n\nEvery complex code has a potential loophole, and our contract code is no exception. In our current setup, anyone - you heard me correctly, anyone - can call the `withdraw` function and empty all the funds from the contract. Unacceptable, right? So we need to seal that loophole tightly, and the best way to do this is by restricting the withdrawal privilege to only the contract owner.\n\n<img src=\"/solidity/remix/lesson-4/constructor/constructor1.png\" style=\"width: 100%; height: auto;\">\n\n## Implementing the Constructor for Role Assignment\n\nThe crucial question now becomes: How can we set up this contract such that only the contract owner can call the `withdraw` function?\n\nWe could try to create a function, let's name it `callMeRightAway`. This function would assign the role of contract owner to the contract's creator as soon as the contract is deployed. However, this would require two transactions. As engineers, we strive for efficiency; we need a leaner solution.\n\nLuckily for us, Solidity has a tool built for this task: the Constructor function. For those familiar with other programming languages, you'll notice the Constructor function is quite similar across the spectrum.\n\nIn Solidity, creating a constructor function is straightforward:\n\n```js\nconstructor() {}\n```\n\nNote that we don't use the `function` keyword, nor do we need the `public` keyword. Remix will even conveniently highlight it pink for us.\n\n## Using Constructor to Assign Contract Owner\n\nNow that we have our constructor sorted out, let's discuss its functionality. The constructor function is immediately and automatically called when you deploy your contract, within the same transaction that deploys the contract.\n\nGiven this attribute, we can use the constructor to set an address as the contract's owner right after the contract's deployment.\n\n```js\naddress public owner;\nconstructor() {\n    owner = msg.sender;\n}\n```\n\nHere, we initiated `address public owner;` a global variable which will hold the contract owner address. Then in the constructor function, we assign `msg.sender` to the owner variable. In this context, `msg.sender` refers to the contract's deployer.\n\n## Modifying the Withdraw Function\n\nWith the contract owner now set using the `constructor`, the next step is to update the `withdraw` function, ensuring it can only be called by the owner.\n\n```js\nfunction withdraw() public {\n    require(msg.sender == owner, \"must be owner\");\n}\n```\n\nThe `require` keyword checks to ensure that the `msg.sender`, which, as we noted earlier, refers to the caller of the function, must be the owner. If the caller isn't the owner, the operation reverts with an error message \"must be owner.\"\n\n## Wrapping Up\n\nThis modification essentially restricts the access to the `withdraw` function to the contract's owner, sealing the security loophole we identified earlier.\n\nOnce you've updated your contract, you're free to deploy, test your code, and appreciate the efficiency of our new smart contract. With this, you have a more secure and efficient contract.\n\nHappy Coding!\n",
          "updates": []
        },
        {
          "lessonId": "34ce586a-265f-4ab8-9c7f-0b4dc8fd9c72",
          "number": 20,
          "title": "Solidity function modifiers",
          "slug": "solidity-function-modifiers",
          "folderName": "20-modifiers",
          "description": "A deep dive into the use of function modifiers in Solidity. The lesson covers how modifiers can streamline code, especially for administrative functions, and includes practical examples to illustrate the implementation and benefits of using modifiers in contracts.",
          "duration": 3,
          "videoUrl": "FfBPHTBSzk0",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/20-modifiers/+page.md",
          "markdownContent": "---\ntitle: Modifiers\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nIn an earlier lesson, we looked at Solidity and how to create smart contracts on the Ethereum blockchain. One of the most useful aspects of Solidity, especially when dealing with functions that should only be called by a certain administrator or contractor, are its modifiers. In this piece, we are going to dive deep into how modifiers can simplify our code and boost productivity.\n\n## The Problem with Repeated Conditions\n\nLet's imagine we have a smart contract full of administrative functions; these functions should only be executed by the contract owner. The straightforward way to achieve this is by adding a condition to every function to check whether the caller (message sender) is the owner:\n\n```js\nrequire(msg.sender == owner, \"Sender is not owner\");\n```\n\nHowever, having to copy and paste this line of code in every function is a surefire way to clutter our contract, making it more difficult to read, maintain, and debug. What we need is a technique or tool to bundle up this common functionality and apply it to our functions when necessary. This is where Solidity's modifiers come into play.\n\n## Introducing Solidity Modifiers\n\nA modifier in Solidity allows us to embed functionality easily and quickly within any function. They are like regular functions but are used to modify the behavior of the functions in our contract. Let’s create our first modifier.\n\nHere is how we create a modifier:\n\n```js\nmodifier onlyOwner {\n    require(msg.sender == owner, \"Sender is not owner\");\n    _;\n}\n```\n\n**Note**: The modifier's name is 'onlyOwner', mimicking the condition it checks. There's also this weird underscore (`_`) sitting right there in our code.\n\n### Understanding the `_` (Underscore) in Modifiers\n\nThe underscore in the modifier signifies where the remaining code of our function will execute. So if you stick it right after the `require` statement, your function's logic will run only if the `require` condition is met.\n\nHere's an example of how we can apply the `onlyOwner` modifier to our contract's `withdraw` function:\n\n```js\nfunction withdraw(uint amount) public onlyOwner {}\n```\n\nNow when `withdraw` is called, the smart contract checks the `onlyOwner` modifier first. If the `require` statement in the modifier passes, the rest of the function's code is then executed. We can see how this not only streamlines our code, but also enhances visibility of function behaviours.\n\n## The Order of Underscores in Modifiers\n\n<img src=\"/solidity/remix/lesson-4/modifier/modifier1.png\" style=\"width: 100%; height: auto;\">\n\nFor instance, assuming that all the necessary conditions in our `onlyOwner` modifier have been met, if we had the underscore above the `require` statement, the contract executes the `withdraw` function's code first before executing the `require` statement.\n\n## Summary\n\nIn essence, modifiers offer a smart and effective way of handling preconditions in our functions, without having to repeat lines of code. Now, the next time you find yourself having to copy, paste, and check the same line of conditions in multiple functions, consider using a modifier instead- because the best developers, they never work harder, they work smarter.\n\nIn upcoming lessons, we'll look into advanced modifier usages and explore more ways to optimize our smart contract code. Stay tuned!\n",
          "updates": []
        },
        {
          "lessonId": "a47d88b5-9ca7-49b4-bcde-eca953f80e67",
          "number": 21,
          "title": "Test the smart contract without a testnet",
          "slug": "testnet-demo",
          "folderName": "21-testnet-demo",
          "description": "A guide to testing Solidity contracts without deploying to a testnet, focusing on compiling, deploying, and interacting with the 'FundMe.sol' contract. The lesson includes steps for using MetaMask, tracking transactions, and ensuring successful contract interaction.",
          "duration": 5,
          "videoUrl": "Xt7tzGhMMII",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/21-testnet-demo/+page.md",
          "markdownContent": "---\ntitle: Testnet Demo\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nIn this lesson, we'll explore end-to-end testing of a Solidity contract deployment and execution without actually deploying to a testnet. However, if you wish to follow along and deploy on a testnet, feel free to do so.\n\n## Getting Started\n\nFirst off, let's compile our `FundMe.sol` Solidity contract to check if our code is correct. If any contracts were deployed previously, delete them so that you can start fresh.\n\n<img src=\"/solidity/remix/lesson-4/testnet/testnet1.png\" style=\"width: 100%; height: auto;\">\n\nNow, set the **injected provider** to MetaMask and check if it's synced to the correct testnet. Validate that you have some ether (ETH) available in your wallet for testnet transactions.\n\n<img src=\"/solidity/remix/lesson-4/testnet/testnet2.png\" style=\"width: 100%; height: auto;\">\n\n## Locating and Selecting the Contract\n\nNext, we'll navigate to our contract area to identify the correct contract we wish to deploy. If you attempt to deploy an interface, an alert message like, _\"This contract might be abstract\"_ will pop up. However, we'll be deploying the `FundMe` contract. Hit deploy and confirm in MetaMask.\n\nNote that the contract's deployment might take some time, which you can track in the terminal.\n\n## Contract Interaction\n\nUpon successful deployment, you'll find several buttons to interact with your Solidity contract:\n\n- Red button for payable function `fund`\n- Orange button for non-payable withdrawing function\n- Blue buttons for `view` and `pure` functions\n\nThe fund button allows us to send ETH to the contract, the `owner` of the contract is our MetaMask account since we deployed this contract. The minimum value will be set to 5 USD.\n\nYou can call the `fund` function, provided you send some ETH along with it. If called without any value, you will encounter a gas estimation error, indicating insufficient ETH.\n\n```\nWarning: The fund() function encounter a gas estimation error, hinting that you might not have sent enough ETH along with your transaction!\n```\n\nAvoid wasting gas by cancelling the transaction and providing a sufficient amount.\n\n## Ensuring Successful Transaction\n\nSet the amount to 0.1 ETH (or an amount equivalent to the minimum USD amount) and hit confirm on MetaMask. You can track the transaction on etherscan.\n\nFollowing your transaction's successful processing, you'll see the contract’s balance increase by the set value. The `funders` array will register your address, and the mapping `addressToAmountFunded` will reflect your transaction.\n\nYou can check these changes in the ether scan transaction log, which will show the `fund` function call.\n\n## Withdraw Function and Errors\n\nNext, you can initiate the `withdraw` function to reset the mapping and the array. However, keep in mind that our contract set-up only permits the owner to withdraw.\n\nIf a non-owner account tries to withdraw, you will encounter another gas estimation error, indicating that the sender is not an owner. So, we revert to the owner account and initiate a successful withdrawal. Again, this can be tracked in the terminal.\n\nUpon successful withdrawal, the balance resets to zero. Additionally, the `funders` array and mapping also reset to their initial zero states. Attempting to call `addressToAmountFunded` with the same address returns zero.\n\n## Advanced Solidity Concepts\n\nRemember, the following section explores more sophisticated attributes of Solidity. Don't worry if you find difficulty understanding it the first time. Mastery of these concepts isn't necessary to continue.\n\nYou may remember that earlier editions of this tutorial deployed to the Rinkeby testnet, while latest versions encourage deployment to the Sepolia testnet or the most contemporary testnet. Alternatively, you can follow along without deploying to a testnet.\n\nIn this section, we'll explore advanced Solidity pieces focused on efficient gas usage, coding practices that make your code cleaner, and improving overall coding practices. You'll want to pay close attention to these concepts if you aim to excel as an Ethereum Smart Contract coder.\n\nAlways remember that when we refer to the JavaScript VM, we mean the Remix VM. Stay tuned for more fun and learning with Solidity in subsequent posts!\n",
          "updates": []
        },
        {
          "lessonId": "10e8c090-dab6-499f-8f1e-0d3e1c4c8efb",
          "number": 22,
          "title": "Immutability and constants",
          "slug": "solidity-immutability-and-constants",
          "folderName": "22-immutability-and-constants",
          "description": "A tutorial on optimizing Solidity smart contracts for gas efficiency using custom errors. The lesson explains the concept of custom errors and demonstrates how to use them for efficient error handling and reverts in smart contracts.",
          "duration": 8,
          "videoUrl": "BLLyOCo-GKU",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/22-immutability-and-constants/+page.md",
          "markdownContent": "---\ntitle: Immutability and Constants\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nThe Solidity programming language provides tools for improving the efficiency of smart contracts. These tools can be useful when modifying existing contracts to achieve higher levels of professionalism. Although contracts might not reach an 'end to end' level of amazement, they can certainly become better. This blog post focuses on how to utilize these tools in the case of variables set only one time. We will explore this through the optimization of example variables, namely, `owner` and `minimumUSD`.\n\n## Identifying Variables for Optimization\n\nWe talk about `owner` and `minimumUSD` because once these variables are set in our contract, they never change again. Specifically, the `owner` gets set one time during our contract creation whereas the `minimumUSD` gets set one time outside of the constructor function itself. Solidity has some tools that make the process of setting these variables more gas efficient.\n\nLet's use an example contract, named `FundMe`, to illustrate this. We first compile and then deploy this contract onto a JavaScript virtual machine. Money related actions such as funding and withdrawing aren't operational since there's currently no Chainlink network on our JavaScript VM. However, that's not what we're primarily concerned with right now.\n\n## Evaluating the FundMe Contract\n\nOur concerns are twofold:\n\n1. The amount of gas required to send the contract.\n2. The gas cost required to create the contract.\n\nTo give a sense of scale, creating this contract initially costs about 859,000 gas. Throughout this lesson, we're going to learn some tricks to reduce this number.\n\n## Implementing Tricks: Constant and Immutable\n\nThe two tricks in focus today are `constant` and `immutable` keywords. The Solidity language provides these keywords to ensure that your variables remain unchanged. To understand these keywords in greater depth, consult the [Solidity documentation](https://solidity.readthedocs.io/).\n\nWe can apply the `constant` keyword to a variable that we assign once outside of a function and then never change afterwards. If it's assigned at compile time, we can add the `constant` keyword. Adding the 'constant' keyword has an additional benefit in that it prevents our variable from occupying a storage slot, thus making it easier to read.\n\n### Constant Optimization\n\nTo assess the benefits of adding the 'constant' keyword, let's contrast the gas usage between both contracts. Remarkably, applying the 'constant' keyword results in a saving of approximately 19,000 gas. This reduction is of the order of the gas cost necessary to send Ethereum. However, keep in mind that naming conventions for 'constant' variables usually involve all caps with underscores (e.g. `MINIMUM_USD`).\n\nA little experiment to corroborate this: if we remove the 'constant' keyword and repeat all actions, the system indeed shows higher gas cost for non-'constant' variables. This might not make much difference in cheaper chains but for expensive chains like Ethereum, it's going to be significant.\n\n- As an aside, to convert gas cost to actual monetary terms, you can take the current gas price of Ethereum and multiply this by the cost of calling our 'minimumUSD'.\n\n<img src=\"/solidity/remix/lesson-4/constants/constant1.png\" style=\"width: 100%; height: auto;\">\n\n### Immutable Optimization\n\nWhile 'constant' variables are assigned outside of a function, 'immutable' keyword can be used in case we want to assign a variable within a function, but only once. A good practice for specifying 'immutable' variables is prefixing the variable with 'I\\_' (e.g. `i_owner`).\n\nFor our 'owner' variable, we can't set it in the global scope because no function is executing there. However, in functions, there's a message sender. So, we set `i_owner` to message sender within the function. We then modify our 'Require' statement in the contract to check against `i_owner` instead of 'owner'.\n\nComparing the gas usage after making 'owner' an 'immutable' variable, we observe savings similar to the 'constant' case.\n\n## Wrapping up and looking forward\n\nThese small gas optimization tricks will make a world of difference in running smart contracts. However, as you're learning Solidity, don't fret about making your contracts as gas efficient as possible from the get-go. As you become more seasoned and grasp Solidity efficiently, you can revisit and work on gas optimization.\n\n<img src=\"/solidity/remix/lesson-4/constants/constant2.png\" style=\"width: 100%; height: auto;\">\n\nOptimized contracts store variables directly into the bytecode of the contract instead of storing them inside a storage slot. The implications of this fact will unfold more clearly as you grow in your Solidity journey, so stay tuned!\n",
          "updates": []
        },
        {
          "lessonId": "76e2a14f-a694-430a-80bb-b5189b7186ec",
          "number": 23,
          "title": "Creating custom errors",
          "slug": "solidity-custom-errors",
          "folderName": "23-custom-errors",
          "description": "A tutorial on optimizing Solidity smart contracts for gas efficiency using custom errors. The lesson explains the concept of custom errors and demonstrates how to use them for efficient error handling and reverts in smart contracts.",
          "duration": 3,
          "videoUrl": "IF-NH74fZMU",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/23-custom-errors/+page.md",
          "markdownContent": "---\ntitle: Custom Errors\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\n## Optimizing Smart Contracts for Gas Efficiency Using Custom Errors\n\nHello, everyone! It's great to have you back. In this lesson, we'll be taking strides to improve the efficiency of our smart contracts. Recently, we've emphasized making our contracts more gas-efficient. Little by little, we've introduced elements of gas efficiency — something I will be explaining further as we delve deeper into the complexities of smart contracts.\n\nFor now, let's not get too bogged down in the nitty-gritty details of these gas efficiencies. If you find the details too complex, don't sweat! We will elaborate on them later.\n\n## Existing Gas Optimizations\n\nWith recent enhancements, we're able to adopt more efficient approaches with our contracts. Let's discuss our current gas optimizations and how to improve yet further.\n\n## Enhancing Efficiency: Updating Requires\n\nOne way to elevate our gas efficiency is by updating our `require` statements. As it stands, our `require` statement forces us to store this 'sender is not an owner' as a string array. When you consider how each character in this error log is stored individually, it quickly becomes apparent that the logic required to manage it all can be bulky and inefficient, especially when there is a far more gas-friendly alternative available.\n\n## Utilize Custom Errors for Reverts\n\nIntroduced with Solidity 0.8.4, we can now take advantage of custom errors for our reverts. This feature allows us to declare errors at the top of our code, and utilize `if` statements instead of `require`. All our error calls will no longer need to address the entire error message string - instead, we'll simply call the error code.\n\nLet's break this down into a practical example.\n\nInstead of using the `require` statement, we could create a custom error of our own:\n\n```js\nerror NotOwner()\n```\n\nPlease note that this definition is out of the contract's scope. With our custom error defined named 'NotOwner', we can amend our 'onlyOwner' function.\n\nFirstly, we'll replace the `require` function with an `if` statement:\n\n```js\nif (msg.sender != I owner) {}\n```\n\nBy using the `revert` function with our newly-created 'NotOwner' error, we replace the necessity for the error string.\n\n```js\nrevert NotOwner();\n```\n\nThis strategy saves us resources as we no longer need to store or emit an extensive string, and instead, rely on the much more efficient error code.\n\nPlease bear in mind, this less efficient coding style is still prevalent as custom errors are relatively new to Solidity. Hence, becoming proficient in both methods will prove beneficial.\n\n<img src=\"/solidity/remix/lesson-4/errors/customerrors1.png\" style=\"width: 100%; height: auto;\">\n\nWhile the current syntax is more abundant, I anticipate, as the shorthand syntax gains popularity, we will see a shift towards the more legible and compact style.\n\n## The Power of Revert\n\nThe \"revert\" keyword performs the same function as `require`, but it doesn't need a conditional statement beforehand. Therefore, it provides an efficient way to revert any transaction or function call midway through the function call.\n\nImproving our require statement is just one way to increase gas efficiency. We could convert all of our require statements to this more efficient form, but I'll leave some in their original state in this post to illustrate both methods.\n\nStay tuned for more posts where we delve deeper into the finer details of Solidity and its best practices.\n",
          "updates": []
        },
        {
          "lessonId": "e1882df5-5415-4d86-b1d5-5aa6875f35c7",
          "number": 24,
          "title": "Implementing the receive fallback",
          "slug": "receive-fallback",
          "folderName": "24-receive-fallback",
          "description": "This lesson covers the implementation of '_receive_' and '_fallback_' functions in Solidity. It explains their significance in handling Ether sent directly to a contract and demonstrates their practical application in a 'FundMe' contract scenario.",
          "duration": 13,
          "videoUrl": "sgaBmbsriwk",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/24-receive-fallback/+page.md",
          "markdownContent": "---\ntitle: Receive & Fallback\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nIn Solidity, a hurdle can arise when users send Ether directly to a contract without passing through necessary function calls. This lesson provides a step-by-step guide on how to mitigate this issue using Solidity's special functions, namely `_receive_` and `_fallback_`.\n\nTo illustrate, take a contract that requires funding. Without passing through the specified function calls (e.g., the \"fund\" function), the contract would not track the funder nor update their details. If the contract aimed to reward funders, those who funded directly, bypassing the necessary function calls, would be overlooked. This lack of tracking could be whether the user misdialed the function or did not use a tool that notifies on probable transaction failure. But there is a solution — the _receive_ and _fallback_ functions.\n\n## Special Functions in Solidity\n\nTwo special functions in Solidity allow the triggering of certain code when users send Ether directly to the contract or call non-existent functions. These are the _receive_ function and the _fallback_ function. They cannot have arguments and don't return anything, thus needing external visibility and payable state mutability.\n\nIn simple terms, they are coded as follows:\n\n```js\nreceive() external payable { }\nfallback() external payable { }\n```\n\nTo experiment with this, let's create a separate contract.\n\n```js\n//SPX-License-Identifier: MIT\npragma solidity ^0.8.7;\ncontract FallbackExample {\n    uint256 public result;\n    receive() external payable {\n        result = 1;\n    }\n}\n```\n\nIn this contract, `result` is initialized to zero. Upon sending Ether to the contract, the `receive` function is triggered, hence `result` equals one.\n\nFor an added twist, we can code the contract to call a non-existent function upon sending Ether.\n\n```js\nfallback() external payable {result = 2;}\n```\n\nWith data in the transaction, the `receive` function isn't triggered. Instead, the contract seeks a matching function for the data input without finding one. Consequently, it defers to the `fallback` function. Hence, `result` equals two.\n\nAs an aside, the `fallback` function is also triggered when a contract is called with no valid function.\n\nThese two functions are brilliantly elucidated in a chart on SolidityByExample.org [here](https://solidity-by-example.org/fallback/).\n\n## Application on FundMe Contract\n\nWith this understanding, let's consider how to apply the special functions to our FundMe contract to ensure that every funder is tracked.\n\n```js\nreceive() external payable {\n    fund();\n}\nfallback() external payable {\n    fund();\n}\n```\n\nIn the event of a user sending Ether directly to the contract, instead of calling the `fund` function, the `receive` function picks it up and re-routes the transaction to `fund`.\n\n<img src=\"/solidity/remix/lesson-4/fallback/fallback1.png\" style=\"width: 100%; height: auto;\">\n\nTest our updated FundMe contract on Sepolia, a 'real' testnet, substituting your contract's address:\n\nCopy the contract's address and send some Ether to it via MetaMask. On confirming the transaction, we should ideally see that the 'fund' function is being called.\n\nChecking back at Remix, the `funders` array will update to reflect the successful transaction. This signifies that the `receive` function rerouted the funding to the `fund` function properly.\n\nThis workaround ensures all transactions - correct or misdialed - are processed in the intended manner. Although a direct call to the `fund` function costs less gas, the user's contribution is acknowledged and credited.\n\nThanks for reading! Keep learning and we'll see you in the next lesson.\n",
          "updates": []
        },
        {
          "lessonId": "84d77e62-a910-4104-a981-77dbf5887722",
          "number": 25,
          "title": "Congratulations",
          "slug": "recap-congratulations-fundme",
          "folderName": "25-recap-congratulations",
          "description": "A recap of the advanced aspects of Solidity covered in previous lessons, highlighting the transition from using Remix to a code editor. The lesson congratulates learners on mastering Solidity basics and introduces upcoming advanced topics for further exploration.",
          "duration": 3,
          "videoUrl": "GjTUKo7k9HY",
          "rawMarkdownUrl": "/routes/solidity/3-fund-me/25-recap-congratulations/+page.md",
          "markdownContent": "---\ntitle: Recap & Congratulations\n---\n\n_Follow along this chapter with the video bellow_\n\n\n\nWe've ventured into the advanced realm of Solidity, and it has been an enlightening journey, to say the least. Brace yourselves, because we're about to dig deeper. However, we're not using Remix this time around. We are migrating to a code editor for a more comprehensive view and working process of Solidity. And as we transition into advanced sections, let's pat ourselves on the back for mastering the majority of Solidity basics!\n\nBut do not rest on your laurels just yet, there's a whole ocean of knowledge still waiting to be explored.\n\n## Advanced Sections of Solidity\n\nThere's plenty to learn still, starting from `enums` `event_`, `try/catch` `function selectors`, and `abi encoding hashing`. It may seem daunting at first, but if you've made it this far, chances are, you can already decipher most Solidity code. Great job!\n\nBut for now, let’s summarize some of the advanced aspects we've come across.\n\n## Special Functions in Solidity\n\nIn the dazzling sphere of Solidity, we have some special functions, namely `receive`, `fallback`, and `constructor`.\n\nThese unique functions don't need the `function` keyword to be called.\n\n```js\nfunction receive() external payable { }\n```\n\nBoth `receive` and `fallback` are unique. They come into play when data is sent through a transaction, but no function was specified. Here, the transaction will default to the fallback function, provided it exists.\n\nAnd, if this data is empty and there's a `receive` function, the transaction will call this function instead.\n\n## Saving Gas with Keywords\n\nIn an era of rising gas prices, Solidity offers a couple of handy keywords like `constant` and `immutable` to help you save gas.\n\nThese keywords are for variables that can only be declared and updated once. A perfect example is:\n\n```js\nuint constant minimumUSD = 50 * 1e18;\n```\n\nIn this case, `minimumUSD` can never be changed again, thus saving gas.\n\nWhile similar to `constant`, `immutable` differs in allowing one-time variable declaration within the `constructor`. After declaration, the variable cannot be changed.\n\nAttempts to update either `constant` or `immutable` variables will be met with compiler errors explicitly stating they cannot be written to.\n\n## Sending Ether with Remix\n\nRemix provides a simple way to send Ether to a contract on the JavaScript virtual machine. Simply deploy the contract, then press the `transact` button without any call data while updating the transaction's value. A lack of call data will trigger the `receive` function (if it exists); otherwise it will set off the `fallback` function.\n\n<img src=\"/solidity/remix/lesson-4/end/recapend.png\" style=\"width: 100%; height: auto;\">\n\nAs we delve deeper into the advanced features of Solidity, there's much more to explore. Here's to unraveling the ins and outs of Solidity, and celebrating more milestones together on our coding journey!\n\nCongratulations again for making it this far! You're doing great!\n",
          "updates": []
        }
      ]
    },
    {
      "sectionId": "f351e657-b163-4a72-9642-680aea1ad239",
      "number": 4,
      "title": "AI Prompting",
      "slug": "ai-prompting",
      "folderName": "4-ai-prompting",
      "lessons": [
        {
          "lessonId": "8bf2aad7-26e9-4950-9c37-c7991d8fd579",
          "number": 1,
          "title": "AI and forums",
          "slug": "ai-and-forums",
          "folderName": "1-ai-and-forums",
          "description": "A lesson on using AI tools like Chat GPT, Bing's AI, and Google's BERT for debugging in software engineering. It covers the importance of understanding errors, writing clear instructions for AI, and the limitations of AI in debugging. The lesson also emphasizes the significance of documentation and online forums for resolving coding issues.",
          "duration": 13,
          "videoUrl": "Y4HylRGK6Rk",
          "rawMarkdownUrl": "/routes/solidity/4-ai-prompting/1-ai-and-forums/+page.md",
          "markdownContent": "---\ntitle: AI prompting and Forums\n---\n\n_Follow along the course with this video._\n\nThe barrier for entry into the world of software and blockchain engineering is smaller than ever. Inevitably we're going to run into problems while coding and knowing where and how to find solutions is an extremely valuable skill.\n\nHere are the exact 6 steps to solve any problem you may face.\n\n1. Tinker\n2. Ask Your AI\n3. Read Docs\n4. Web Search\n5. Ask in a Forum\n6. Ask on the Support Forum or GitHub\n7. Iterate\n\nLets go through them.\n\n### Tinker\n\nPinpoint your error, review your code manually making small adjustments you suspect may resolve the issue. Pinpointing the error in your code will help you frame your question/prompt in the next step.\n\n<img src=\"/solidity/ai-prompting/debug1.png\" style=\"width: 100%; height: auto;\">\n\n### Ask Your AI\n\nThere are several AI models available these days, each with their pros and cons. Here are a few to consider.\n\n- [**ChatGPT**](https://chat.openai.com) - The OG. This model offered by OpenAI is robust, multi-modal, includes code interpretion and can browse the web. The best quality unfortunately comes from the paid version.\n- [**Phind**](https://www.phind.com/search?home=true) - This is a programming focused model with intuition allowing it to proactively ask questions to clarify assumptions. Can also browse the web, and has a VS Code extension!\n- [**Copilot**](https://www.microsoft.com/en-us/edge/features/copilot?form=MA13FJ) - formerly `Bing Chat`, and not to be confused with the IDE AI assistant, Copilot is rapidly becoming Microsoft's whole ecosystem response to the age of AI\n- [**Google Bard**](https://bard.google.com/) - ehhhhh - results may vary.\n\nThere are `6 principles` to prompt engineering to get the best out of your AI.\n\n- **Principle 1:** Write clear and specific instructions\n- **Principle 2:** Give as much context as possible\n- **Principle 3:** Use delimiters to clearerly indicate distinct parts of the input\n- **Principle 4:** Look out for `hallucinations`\n- **Principle 5:** Understand the limitations of the model - many have strict context token limits (though this is rapidly changing)\n- **Principle 6:** Iterate constantly\n\n> Hallucinations are when an AI provides a response that it thinks is correct, but is wrong. These can be hard to spot and require a little experience to call out.\n\nAsking questions is a skill, so keep practicing. There's a great free course at [**learn.deeplearning.ai**](https://learn.deeplearning.ai/) that can help software engineers become better prompt engineers.\n\n### Read Docs\n\nIf a problem is occuring with a particular implementation, framework, language - whatever - you can almost always read the documentation for further insight and examples of how to accomplish your goals.\n\n> You can even use AI to help you here by copying docs as context into a model like ChatGPT and asking questions to it\n\n### Web Search\n\nSomething many AIs are lacking is the ability to retrieve up to date information, or they're limited by not having access to the web. This is where good ol' fashioned web search comes in.\n\nIf you're running into an issue, it's highly likely someone else has to, and search engines like Google have already indexed these questions to serve their answers to you.\n\n> Note: AI Models are advancing rapidly and many models as of Dec 2023 also include web search.\n\n### Ask in a Forum\n\nSometimes the information we need just isn't out there and we're forced to interact with _human beings_\n\nWe always want to ask our questions in a web-indexed forum which will allow search engines and future AI models to index this new information. A few examples are:\n\n- [**Ethereum Stack Exchange**](https://ethereum.stackexchange.com/) - a community-driven question-and-answer platform dedicated to Ethereum, and blockchain technology\n- [**Stack Overflow**](https://stackoverflow.com/) - online platform that facilitates knowledge exchange and problem-solving within the global programming and software development community\n- [**Peerhana**](https://peeranha.io) - Peeranha is a decentralized knowledge sharing platform built on web3 technology, particularly blockchain\n- [**Reddit**](https://www.reddit.com/) - Reddit is a widely popular and diverse social media platform that serves as a hub for online communities, discussions, and content sharing\n\nQuestions asked on Discord and Twitter are likely to get buried in their conversational chaos and will never be indexed, so use these avenues sparingly.\n\n> The super secret alpha is to post your question on a forum like Stack Exchange, then link to that question in your Discord message!\n\nAlways remember to format your questions using markdown when appropriate.\n\n### Ask on the Support GitHub or Forum\n\nIf the tool you're using isn't open source - maybe reconsider how necessary it is! Haha\n\nOpen source projects on GitHub allow people to submit improvements and raise issues, this is how we improve our code.\n\n### Iterate\n\nRepeat the above steps again and again.\n\n### General Tips\n\nThe above are a number of effective steps to overcome issues you'll have while learning. Here are a few additional general tips to keep in mind:\n\n1. **Limit self-triage to 15/20 minutes** - don't force yourself to struggle through solving an issue alone. There are countless tools available to assist in focusing on where the error is and how to solve it\n2. **Don't be afraid to ask AI, but don't skip learning** - AI is going to `hallucinate` it's going to get things wrong. It's only by learning and understanding the underlying concepts that someone will be able to spot these errors and inconsistencies\n3. **Use the Forums!!!** - Asking questions in the GitHub discussions and on forums is a great way to find support - and helping others with their problems is a great way to reinforce what you've learnt\n4. **Google the exact error** - A problem you're having is likely to have been faced by someone else. Leverage search engines to find past solutions\n5. **Make Accounts on Stack Exchange and Peeranha** - These communities are invaluable to assist with Web3 software engineering and coding problems. Use them.\n6. **Post Issues on GitHub/Git** - Interacting with the community is an integral part of the Web3 and software development communities. Open source projects allow the submission of `Issues` and `Pull Requests` on GitHub. Be respectful, but if you're unable to find answers, or believe you're hitting a bug in a protocol - creating issues is a great way to bring these problems to a project's attention.\n\n> Be sure to search for already open issues before submitting a new one to an open source project\n\nIf you don't have any experience with GitHub, don't worry. Our next lesson will be going over the set up of an account to get you started.\n\nAnd, as ChatGPT would say \"Keep hopping through the code, and until next time, stay ribbeting, my fellow blockchaineers!\" 🤦‍♂️😬\n",
          "updates": []
        },
        {
          "lessonId": "fa0c07d3-1169-49e7-ab1e-761b2d8645d8",
          "number": 2,
          "title": "Setting up Github",
          "slug": "setting-up-github",
          "folderName": "2-setting-up-github",
          "description": "This lesson guides through the process of setting up a GitHub account, emphasizing its importance in the software development community. It discusses how to ask well-crafted questions on GitHub to engage effectively with the coding community and get helpful responses.",
          "duration": 2,
          "videoUrl": "Tmv2cggeqGE",
          "rawMarkdownUrl": "/routes/solidity/4-ai-prompting/2-setting-up-github/+page.md",
          "markdownContent": "---\ntitle: Setting up GitHub\n---\n\n_Follow along the course with this video._\n\n---\n\nHere I'm going to walk you through the creation of a GitHub account.\n\nAsking well-formatted, articulate questions greatly enhances your chances of receiving prompt and effective answers. Many times, these communities are comprised of people who answer queries simply out of goodwill and a shared passion for the knowledge involved. Therefore, make sure your questions are well-crafted to do justice to their time and effort!\n\n<img src=\"/solidity/ai-prompting/github1.png\" style=\"width: 100%; height: auto;\">\n\nA key platform to engage with these communities is GitHub. If you haven't already, now's the perfect time to activate an account. Don't skip ahead, this is imperative. Let's get started.\n\n### **Step 1: Signing Up for GitHub**\n\nGitHub is the go-to platform for developers. It offers a manageable approach to maintaining code repositories and facilitates collaborative coding and issue resolution. Setting up an account on GitHub is pretty straightforward. If you haven't already done this, you will need an email to get started.\n\n<img src=\"/solidity/ai-prompting/github3.png\" style=\"width: 100%; height: auto;\">\n\nTo sign up for GitHub, just click on \"Sign up\" and enter your valid email address.\n\n<img src=\"/solidity/ai-prompting/github4.png\" style=\"width: 100%; height: auto;\">\n\n## **Step 2: Account Creation**\n\nClick on \"Create account\". After registering your email on GitHub, you will receive an email with a launch code. Provide this to GitHub and answer a few preliminary questions.\n\nWhen prompted, choose the free version.\n\n<img src=\"/solidity/ai-prompting/github5.png\" style=\"width: 100%; height: auto;\">\n\nAnd voila! You've created your GitHub profile.\n\n<img src=\"/solidity/ai-prompting/github6.png\" style=\"width: 100%; height: auto;\">\n\n### **Moving Forward: Asking 'Great' Questions**\n\nThe following lesson is going to have a focus on question formatting. In order to get timely responses in communities like GitHub you need to be considerate of the questions you're asking and how you're asking them.\n\nDon't skip the next lesson!\n",
          "updates": []
        },
        {
          "lessonId": "199491e0-daaa-45e2-ac0a-d4ad722e07aa",
          "number": 3,
          "title": "Formatting a question",
          "slug": "formatting-a-question",
          "folderName": "3-formatting-a-question",
          "description": "A guide on how to ask effective questions in code discussions, particularly on GitHub. It covers the importance of clear, concise, and well-formatted questions, and includes tips on using markdown for code formatting and highlighting specific errors to get better responses.",
          "duration": 6,
          "videoUrl": "LYVXiIFwLTQ",
          "rawMarkdownUrl": "/routes/solidity/4-ai-prompting/3-formatting-a-question/+page.md",
          "markdownContent": "---\nFormatting a Question\n---\n\n_Follow along the course with this video._\n\nHello, coders! In this lesson we'll be covering the importance of well crafted questions and how to properly format our inquires to give them the best chance of receiving a response.\n\n## Creating Discussions in GitHub\n\nAs practice, I want you to navigate to the [**GitHub discussions page**](https://github.com/Cyfrin/foundry-full-course-f23/discussions) for this course and try creating a discussion yourself!\n\n> Try to categorize your discussion appropriately. `General` for conversations and discussions, `QA` for questions.\n\n<img src=\"/solidity/ai-prompting/question1.png\" style=\"width: 100%; height: auto;\">\n\n## The Art of Asking Questions\n\nWe often come across questions that are asked in a hasty and incoherent manner. Here's an example of a poorly formatted question:\n\n```\n\"Hey why my code not be good?\"\n\nquire(msg.value == entranceFee * newPlayers.length, \"PuppyRaffle: Must send enough to enter raffle\");\n        for (uint256 i = 0; i < newPlayers.length; i++) {\n```\n\nWe need to be clear in describing our problem, the steps we took that got us to the problem, and explicit in any errors we're receiving.\n\nA better example would be:\n\n---\n\n\"I am receiving this error when compiling.\":\n\n```bash\nTypeError: Exactly one argument expected for explicit type conversion.\n--> PriceConvertor.sol:21:43:\n|\n21|    AggregatorV3Interface priceFeed = AggregatorV3Interface()\n|\n```\n\nHere's my code:\n\n```js\nAggregatorV3Interface priceFeed = AggregatorV3Interface()\n```\n\nCould someone please help me figure out what the issue is? 🙏\n\n---\n\nQuite simply, we can take the following necessary steps while crafting our questions:\n\n1. **Describe the issue clearly and concisely** - Be clear in the problem you're facing and what steps got you there\n2. **Highlight the specific error you're experiencing** - including exact error messages can provide those helping you with valuable insight into where things went wrong\n3. **Use markdown for code formatting** - this is critical, formatting your code allows your question to be more readable and approachable for those trying to understand the problem\n4. **Share the relevant part of the code causing the issue** - only include what's relevant to your issue. Don't paste a whole contract into your question unless appropriate to do so. You can provide _too much_ information.\n\nWith a well formatted question, you're going to see a much higher rate of success in receiving help from others as well as AI.\n\n> The importance of markdown formatting cannot be stressed enough. If you're unfamiliar with markdown, don't hesitate to ask an AI like ChatGPT for advice, or to format things for you.\n\n### Wrapping Up\n\nAlways remember, there are no _`bad questions`_ but there are _`poorly formatted questions`_. Make your questions count and format them appropriately.\n\nA pillar of becoming a software engineer is being involved in these communities. Jump in and participate, ask questions and meet people. Contribution is the cornerstone of open source communities. Do your best to answer as many questions as you ask, this will reinforce your knowledge.\n\n> You don't have to be an expert to help those on the journey behind you.\n",
          "updates": []
        },
        {
          "lessonId": "f5b5f8d6-59cc-45ff-8704-1cf86308b2c5",
          "number": 4,
          "title": "Speedrun",
          "slug": "speedrun",
          "folderName": "4-speedrun",
          "description": "An introduction to 'Speedrun Ethereum' by Austin Griffin, a resource for learning about Ethereum and the Ethereum Virtual Machine (EVM). The lesson covers various projects like creating NFTs, staking apps, and learning about on-chain randomness, and recommends using Scaffold ETH for practical learning.",
          "duration": 4,
          "videoUrl": "N7D93c4oSZM",
          "rawMarkdownUrl": "/routes/solidity/4-ai-prompting/4-speedrun/+page.md",
          "markdownContent": "---\ntitle: Speedrun Ethereum\n---\n\n_Follow along the course with this video._\n\n---\n\nIn this section we're examining a resource that isn't explicitly part of this course but is highly useful in expanding your knowledge about Ethereum and the Ethereum Virtual Machine (EVM). This resource comes courtesy of my good friend Austin Griffin. Let's go over what it can do for you.\n\n<img src=\"/solidity/speedrun/speedrun1.png\" style=\"width: 100%; height: auto;\">\n\n### Introduction to Speedrun Ethereum w/ Austin Griffin\n\nAustin Griffin, renowned for his conspicuous bow tie, is eager to help you kickstart your journey of creating on Ethereum through [**speedrunethereum.com**](https://speedrunethereum.com/). He's developed this resource to clarify the ‘HOW’ and ‘WHY’ behind Ethereum building.\n\nThrough Speedrun Ethereum, you'll delve into a plethora of projects, including:\n\n- **Creating a simple Non-Fungible Token (NFT)**\n- **Constructing a decentralized staking app**\n- **Developing a token vendor**\n- **Building a Dice Game** - learning about randomness on chain\n- **Creating a Decentralized Exchange (Dex)**\n- **Contructing and using a MultiSig Wallet**\n- **SVG NFTs and on chain Data**\n\n...and much more\n\n<img src=\"/solidity/speedrun/speedrun2.png\" style=\"width: 100%; height: auto;\">\n\nTo take advantage of these learning opportunities, visit [Speedrunethereum.com](https://speedrunethereum.com/) and get started!\n\n### Intro to Scaffold-ETH2\n\nScaffold-eth-2 is a great resource for those learning Solidity and trying to visualize what their code is doing.\n\nIt provides a clean front-end UI that will update dynamically with your smart contract changes, allowing you to interact with it and monitor adjustments you've made.\n\n<img src=\"/solidity/speedrun/speedrun3.png\" style=\"width: 100%; height: auto;\">\n\n### Final Remarks\n\nLeverage the knowledge and resources provided by speedrun ethereum and Scaffold ETH to equip you in building innovative solutions on Ethereum. With determined effort and continuous learning, you're sure to make significant strides in the blockchain ecosystem.\n\nHappy Bow-Tie Friday, Austin.\n\n### Congratulations!\n\nYou did it. That's all for this section - you should be incredibly proud. Take a break and rest up, cause you're ready to move on to [**Foundry Fundamentals**](https://updraft.cyfrin.io/courses/foundry)!\n",
          "updates": []
        }
      ]
    }
  ],
  "createdAt": "2023-12-18T15:14:18.698Z",
  "updatedAt": "2023-12-18T15:14:18.698Z"
}